{
  "source_file": "ciencia-da-computacao-e-para-voce.html",
  "metadata": {
    "url": "ciencia-da-computacao-e-para-voce",
    "title": "Ciência da Computação é para você? - Inteli - Instituto de Tecnologia e Liderança",
    "description": "Entenda o que diferencia Ciência da Computação de outros cursos da área e descubra se essa é a graduação ideal para o seu futuro na tecnologia.",
    "keywords": [],
    "page_type": "geral"
  },
  "content_blocks": [
    {
      "type": "paragraph",
      "text": "Inteli>Graduação>Ciência da Computação é para você?",
      "section": null,
      "subsection": null
    },
    {
      "type": "section_title",
      "level": 1,
      "text": "Ciência da Computação é para você?",
      "section": "Ciência da Computação é para você?",
      "subsection": null
    },
    {
      "type": "list_block",
      "text": "Inteli>Graduação>Ciência da Computação é para você?\n\n- Time Inteli\n- 13 out 2025\n- Time Inteli\n- 13 out 2025",
      "section": "Ciência da Computação é para você?",
      "subsection": null,
      "original_count": 4
    },
    {
      "type": "paragraph",
      "text": "Autores: Rodolfo Goya e Tomaz Mikio Sasaki, professores do Inteli Em uma busca em um site de vagas de estágios e empregos, se encontra um anúncio que diz:",
      "section": "Ciência da Computação é para você?",
      "subsection": null,
      "original_count": 2
    },
    {
      "type": "table",
      "text": "Vaga: Auditor de Sistemas PlenoRequisitos: Graduação completa em Sistemas de Informação,Ciência da Computação, Segurança da Informação, ou áreas correlatas com foco em tecnologia.",
      "section": "Ciência da Computação é para você?",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Outro anúncio diz:",
      "section": "Ciência da Computação é para você?",
      "subsection": null
    },
    {
      "type": "table",
      "text": "Vaga: Desenvolvedor Frontend PlenoRequisitos: Nível Superior em TI (Ciência da Computação / Engenharia da Computação) ou similares",
      "section": "Ciência da Computação é para você?",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "E mais outro:",
      "section": "Ciência da Computação é para você?",
      "subsection": null
    },
    {
      "type": "table",
      "text": "Vaga:Senior Android EngineerRequisitos:Bachelor’s degree inComputer Science, Software Engineering, or related fields.",
      "section": "Ciência da Computação é para você?",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Em comum, os anúncios exigem o curso deCiência da Computação,mas também citam outros possíveis cursos (Sistemas de Informação, Engenharia da Computação, Engenharia de Software etc.), o que traz a dúvida:",
      "section": "Ciência da Computação é para você?",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Qual a diferença entre esses diversos cursos relacionados à computação, uma vez que essas vagas podem ser preenchidas por candidatos de qualquer um deles?",
      "section": "Ciência da Computação é para você?",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Há uma fábula antiga sobre pessoas vendadas que não conhecem o que é um elefante e tentam descrever como ele é tocando um: uma delas toca a tromba e diz “um elefante é como uma mangueira”, outra toca a perna e diz “um elefante é como uma coluna” um terceiro toca a lateral e diz “um elefante é como uma parede”, outro toca a cauda e assim por diante.",
      "section": "Ciência da Computação é para você?",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Computação é um elefante, tem diversas nuances: dados, algoritmos, infraestrutura, interface com o usuário, processos de desenvolvimento, etc. Diferentes cursos focam em nuances distintas. ChatGPT said:",
      "section": "Ciência da Computação é para você?",
      "subsection": null,
      "original_count": 2
    },
    {
      "type": "paragraph",
      "text": "Há uma sobreposição nas habilidades desenvolvidas entre esses cursos, já que as empresas buscam profissionais com competências práticas em computação. Por isso, é comum que seus currículos coincidam em áreas como lógica de programação, banco de dados e sistemas operacionais. No entanto, isso não significa que todos os cursos sejam iguais, cada um possui um foco e uma abordagem específicos.",
      "section": "Ciência da Computação é para você?",
      "subsection": null
    },
    {
      "type": "subsection_title",
      "level": 2,
      "text": "O que diferencia o curso de Ciência da Computação dos demais?",
      "section": "Ciência da Computação é para você?",
      "subsection": "O que diferencia o curso de Ciência da Computação dos demais?"
    },
    {
      "type": "paragraph",
      "text": "Historicamente, os cursos com o nome “Ciência da Computação” foram os primeiros dedicados à área de computação a surgir no Brasil em 1969, na Unicamp . No exterior surgiu um pouco antes, com a expansão do número de cursos a partir da década de 1960.Ciência da Computação surgiu para atender a necessidade crescente de profissionais especializados na teoria, desenvolvimento de software e fundamentos da computação.",
      "section": "Ciência da Computação é para você?",
      "subsection": "O que diferencia o curso de Ciência da Computação dos demais?"
    },
    {
      "type": "paragraph",
      "text": "Nessa época, enquanto a Engenharia Eletrônica ensinou a desenvolver os circuitos e dispositivos elétricos e eletrônicos do hardware dos computadores, a Ciência da Computação tratou da teoria da computação e desenvolvimento de algoritmos para programas (o que leva à brincadeira “hardware é a parte do computador que você chuta, enquanto que software é a parte que você xinga”).",
      "section": "Ciência da Computação é para você?",
      "subsection": "O que diferencia o curso de Ciência da Computação dos demais?"
    },
    {
      "type": "paragraph",
      "text": "Algumas personalidades bem conhecidas fizeram o curso de Ciência da Computação:Linus Torvalds(criador do kernel Linux e do git),Mark Zuckerberg(fundador do Facebook),Satya Nadella(CEO da Microsoft),Marc Andreessen(criador do Netscape, um dos primeiros navegadores web) eJames Gosling(criador da linguagem Java). No Inteli, um de seus fundadores,André Esteves, é formado em Ciência da Computação.",
      "section": "Ciência da Computação é para você?",
      "subsection": "O que diferencia o curso de Ciência da Computação dos demais?"
    },
    {
      "type": "paragraph",
      "text": "À medida que o universo da computação se expandiu, novos cursos tornaram-se necessários para atender as demandas específicas do mercado e da indústria.",
      "section": "Ciência da Computação é para você?",
      "subsection": "O que diferencia o curso de Ciência da Computação dos demais?"
    },
    {
      "type": "paragraph",
      "text": "Assim, por exemplo, o que no início foi uma disciplina do curso de Ciência da Computação e tratava do desenvolvimento, gestão e manutenção de software, posteriormente, com a complexidade crescente dos sistemas e a necessidade de aplicar princípios de engenharia passou a ser uma especialização oferecida como pós-graduação e, nos dias atuais, a Engenharia de Software tornou-se um curso de graduação, indo além desses assuntos em relação ao que era estudado nos primeiros cursos de Ciência da Computação.",
      "section": "Ciência da Computação é para você?",
      "subsection": "O que diferencia o curso de Ciência da Computação dos demais?"
    },
    {
      "type": "paragraph",
      "text": "Do mesmo modo, outros cursos surgiram para atender as demandas do mercado em expansão, portanto, pode-se dizer queCiência da Computação foi a base para a criação dos demais cursos da área de computação.",
      "section": "Ciência da Computação é para você?",
      "subsection": "O que diferencia o curso de Ciência da Computação dos demais?"
    },
    {
      "type": "subsection_title",
      "level": 2,
      "text": "O que o curso de Ciência da Computação tem de diferente?",
      "section": "Ciência da Computação é para você?",
      "subsection": "O que o curso de Ciência da Computação tem de diferente?"
    },
    {
      "type": "paragraph",
      "text": "O curso de Ciência da Computação mantém seu diferencial aodesenvolver a habilidade de seus estudantes nos fundamentos teóricos e matemáticos da computação, como algoritmos, estruturas de dados, teoria da computação, matemática aplicada,etc.permitindo que eles desenvolvam soluções para problemas computacionais complexos – problemas como o de descrever redes de relacionamento complexas no Facebook, definir a melhor rota no Waze ou encontrar um site no Engenho de Busca do Google – todos algoritmos complexos importantes que se destacaram em seus negócios.",
      "section": "Ciência da Computação é para você?",
      "subsection": "O que o curso de Ciência da Computação tem de diferente?"
    },
    {
      "type": "paragraph",
      "text": "Enquanto outros cursos focalizam aspectos mais aplicados para o desenvolvimento de sistemas em diversas áreas, o curso de Ciência da Computação se destaca porformar profissionais de conhecimento mais abrangente:capazes de desenvolver novas tecnologias que, em muitos casos, serão úteis para aqueles formados nos outros cursos. Tópicos de ponta em infraestrutura, inteligência artificial e computação quântica entre outros são assuntos de interesse dentro da Ciência da Computação.",
      "section": "Ciência da Computação é para você?",
      "subsection": "O que o curso de Ciência da Computação tem de diferente?"
    },
    {
      "type": "paragraph",
      "text": "Ao fazer o curso de Ciência da Computação,você será apto a preencher as diversas vagas que solicitam as competências comuns aos diversos cursos da área de computação(como aquelas vagas mencionadas no início da conversa) ou usar essa formação como base para trabalhar em pesquisa e inovação tecnológica em áreas especializadas como inteligência artificial, otimização/logística, desenvolvimento de algoritmos eficientes e modelagem matemática. Voltando ao portal de vagas, quem sabe daqui a 8, 9 ou 10 anos possa se candidatar a vagas como essa:",
      "section": "Ciência da Computação é para você?",
      "subsection": "O que o curso de Ciência da Computação tem de diferente?"
    },
    {
      "type": "table",
      "text": "Vaga:Research ScientistRequisitos:PhD or equivalent research experience in Computer Science, Machine Learning, Artificial Intelligence, or a related field",
      "section": "Ciência da Computação é para você?",
      "subsection": "O que o curso de Ciência da Computação tem de diferente?"
    },
    {
      "type": "paragraph",
      "text": "Esse é um cenário bem específico que talvez seja trilhado somente por alguns que se formarem em Ciência da Computação. De uma forma mais ampla, vocês poderão usar a formação que obteve nos fundamentos da computação para avançar na trilha que escolheram ou em que tiveram a oportunidade de entrar.",
      "section": "Ciência da Computação é para você?",
      "subsection": "O que o curso de Ciência da Computação tem de diferente?"
    },
    {
      "type": "paragraph",
      "text": "Lembrando que, se você fizer aCiência da Computação no Inteli, essa formação será acompanhada de muita prática em projetos, o que tornará essa experiência de aprendizagem ainda mais completa. Compartilhe: Veja também:",
      "section": "Ciência da Computação é para você?",
      "subsection": "O que o curso de Ciência da Computação tem de diferente?",
      "original_count": 3
    },
    {
      "type": "list_block",
      "text": "Veja também:\n\n- Graduação,Mercado Tech,Processo Seletivo,Time Acadêmico",
      "section": "Ciência da Computação é para você?",
      "subsection": "O que o curso de Ciência da Computação tem de diferente?",
      "original_count": 1
    },
    {
      "type": "paragraph",
      "text": "O mundo conectado começa aqui: projetos reais com Internet das Coisas",
      "section": "Ciência da Computação é para você?",
      "subsection": "O que o curso de Ciência da Computação tem de diferente?"
    },
    {
      "type": "list_block",
      "text": "O mundo conectado começa aqui: projetos reais com Internet das Coisas\n\n- Bruna Mayer\n- 13/10/2025\n- Graduação,Processo Seletivo,Time Acadêmico",
      "section": "Ciência da Computação é para você?",
      "subsection": "O que o curso de Ciência da Computação tem de diferente?",
      "original_count": 3
    },
    {
      "type": "paragraph",
      "text": "Qual a diferença entre Engenharia de Computação e Engenharia de Software?",
      "section": "Ciência da Computação é para você?",
      "subsection": "O que o curso de Ciência da Computação tem de diferente?"
    },
    {
      "type": "list_block",
      "text": "Qual a diferença entre Engenharia de Computação e Engenharia de Software?\n\n- Renato Penha\n- 30/09/2025\n- Mercado Tech",
      "section": "Ciência da Computação é para você?",
      "subsection": "O que o curso de Ciência da Computação tem de diferente?",
      "original_count": 3
    },
    {
      "type": "paragraph",
      "text": "O início da jornada profissional",
      "section": "Ciência da Computação é para você?",
      "subsection": "O que o curso de Ciência da Computação tem de diferente?"
    },
    {
      "type": "list_block",
      "text": "O início da jornada profissional\n\n- Time Inteli\n- 08/02/2024",
      "section": "Ciência da Computação é para você?",
      "subsection": "O que o curso de Ciência da Computação tem de diferente?",
      "original_count": 2
    }
  ],
  "statistics": {
    "total_blocks": 35,
    "paragraphs": 27,
    "headings": 3,
    "list_items": 13,
    "tables": 4
  }
}