{
  "source_file": "en_faq.html",
  "metadata": {
    "url": "en_faq",
    "title": "Frequently Asked Questions - Inteli - Institute of Technology and Leadership",
    "description": "",
    "keywords": [],
    "page_type": "geral"
  },
  "content_blocks": [
    {
      "type": "section_title",
      "level": 1,
      "text": "Frequently Asked Questions",
      "section": "Frequently Asked Questions",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "R$7,780.00and a registration fee ofR$2,350.00.",
      "section": "Frequently Asked Questions",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "*Tuition fees are for students entering in 2026. Fees for 2027 will be announced by the enrollment date, taking into account inflation adjustments confirmed by December 2026.",
      "section": "Frequently Asked Questions",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Yes. Inteli has international exchange partnerships with renowned colleges in the United States, Italy, Mexico, Spain, the Netherlands, New Zealand and Argentina. These partnerships will broaden your horizons, improve your fluency in a foreign language, open doors to connect you with professionals and companies, and create more networking opportunities.Our commitment is to offer a unique learning experience with a disruptive model, based 100% on projects, and we know how much exchange enhances this learning. Click on thelink tofind out more about the colleges. Yes, to schedule your visit, simply register here:https://www.inteli.edu.br/campus/ Yes, we currently have a postgraduate course in CyberSecurity which you can check outhere",
      "section": "Frequently Asked Questions",
      "subsection": null,
      "original_count": 3
    },
    {
      "type": "paragraph",
      "text": "Ourscholarship programwas created so that young talents can study at Inteli, regardless of their financial circumstances.",
      "section": "Frequently Asked Questions",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "The scholarships can cover all or part of Inteli's tuition fees. In addition, for students with proven need, we will provide student aid for housing and food costs. 4 years for undergraduate courses. 15 months for postgraduate courses.",
      "section": "Frequently Asked Questions",
      "subsection": null,
      "original_count": 3
    },
    {
      "type": "paragraph",
      "text": "The exec courses vary in length, from short one-day events to medium-length ones lasting between one and two months.",
      "section": "Frequently Asked Questions",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Yes, after a common first year, the student can choose to change course in the second year, subject to availability of places.",
      "section": "Frequently Asked Questions",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Yes, the student can complete the double degree in at least 5 years. The double degree works as follows: the student starts both courses full-time, as the first year is common to all. In the second and third year, the student chooses one of the courses to follow. In the fourth year, classes are held in the evening and students develop their final project, which is also common to all courses. At this point, in the fourth year, the student can study the second course full-time, while completing the first in the evening. With an additional year, the student completes the second course and obtains a double degree. It is important to note that in the fourth year it will not be possible to work due to the accumulated full time and evening hours.",
      "section": "Frequently Asked Questions",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Yes, you can. The Transfer Process takes place through a curriculum analysis, submission of documentation, an individual interview, and a profile and project stage, similar to our selection process. Inteli's Academic Team carries out the necessary analysis and presents the final result.",
      "section": "Frequently Asked Questions",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "No. Inteli is a private non-profit organization founded by entrepreneurs André Esteves and Roberto Sallouti, based on a donation from the Esteves family. Inteli has the institutional support of BTG Pactual in the development of its activities. No. Inteli's facilities are located within the university city, through the IPT Open Experience.",
      "section": "Frequently Asked Questions",
      "subsection": null,
      "original_count": 2
    },
    {
      "type": "paragraph",
      "text": "The program allows private sector partners with research, development, innovation and human resources training work plans to develop their activities on campus. Find out more about the IPT Open Experience",
      "section": "Frequently Asked Questions",
      "subsection": null,
      "original_count": 2
    },
    {
      "type": "paragraph",
      "text": "The IPT, USP and other institutions, such as the Butantã Institute, have facilities in the University City of São Paulo. The institutions have independent administrations.",
      "section": "Frequently Asked Questions",
      "subsection": null
    }
  ],
  "statistics": {
    "total_blocks": 13,
    "paragraphs": 18,
    "headings": 1,
    "list_items": 0,
    "tables": 0
  }
}