{
  "source_file": "en_mulheres-inspiradoras-no-inteli.html",
  "metadata": {
    "url": "en_mulheres-inspiradoras-no-inteli",
    "title": "Inspiring Women at Inteli - Inteli - Institute of Technology and Leadership",
    "description": "",
    "keywords": [],
    "page_type": "geral"
  },
  "content_blocks": [
    {
      "type": "paragraph",
      "text": "Inteli>Campus Life>Inspiring Women at Inteli",
      "section": null,
      "subsection": null
    },
    {
      "type": "section_title",
      "level": 1,
      "text": "Inspiring Women at Inteli",
      "section": "Inspiring Women at Inteli",
      "subsection": null
    },
    {
      "type": "list_block",
      "text": "Inteli>Campus Life>Inspiring Women at Inteli\n\n- Inteli Team\n- 24 Apr 2023\n- Inteli Team\n- 24 Apr 2023",
      "section": "Inspiring Women at Inteli",
      "subsection": null,
      "original_count": 4
    },
    {
      "type": "paragraph",
      "text": "Panel discusses the power of diversity in the corporate environment",
      "section": "Inspiring Women at Inteli",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "One of our goals as a technology college is to empower women so that they occupy more leadership positions in this industry that is still dominated by men. But have you ever wondered why we don't have more women thinking about technological solutions and working in the field?",
      "section": "Inspiring Women at Inteli",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "We believe it's essential to discuss the roots of the problem in order to find solutions that really work for our country. For example, Michael Page's Latin American Women in Technology survey shows that for 47% of the C-level professionals who responded to the study, the number of women in IT is still low in Brazil because there is a lack of inspiring role models for women.",
      "section": "Inspiring Women at Inteli",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "To discuss this topic, we brought together Maíra Habimorad, Inteli's CEO; Flávia Santoro, Inteli's Academic Director and technology researcher, and Maristela Calazans, Nubank's Technology Director, in an inspiring meeting for our students. \"For us, it's very important to help them on this journey of learning and transformation so that we can have a more gender-equitable, plural, diverse and humane society,\" Maíra said. Check out some of the highlights of the chat!",
      "section": "Inspiring Women at Inteli",
      "subsection": null,
      "original_count": 2
    },
    {
      "type": "subsection_title",
      "level": 2,
      "text": "Women, resist!",
      "section": "Inspiring Women at Inteli",
      "subsection": "Women, resist!"
    },
    {
      "type": "paragraph",
      "text": "For Flávia Santoro, the lack of female representation in many areas of technology can make women feel discouraged from entering the field. In addition, there are unconscious prejudices and stereotypes that can lead to gender discrimination in the workplace. \"We need to be proactive, dedicated and never stop studying. It's important to always be engaged in the tech community to create networks of support and solidarity with other women in the field,\" she says.",
      "section": "Inspiring Women at Inteli",
      "subsection": "Women, resist!"
    },
    {
      "type": "paragraph",
      "text": "Maristela, who has been building an outstanding career in the field, commented on how she still feels like a black swan when she is approached for incredible professional opportunities because she is a woman. \"At first I felt really bad, almost guilty. Then I came to understand that sometimes it's important to push the envelope in order to have diversity. We're evolving as a society, and it needs to be like this until people start to think it's natural,\" she says.",
      "section": "Inspiring Women at Inteli",
      "subsection": "Women, resist!"
    },
    {
      "type": "paragraph",
      "text": "Maíra says that when she was invited to join a board of directors, she was pretty sure that one of the main reasons was because she was a woman. \"Instead of feeling offended, I sat down at the table and said: OK, I'm here because I'm a woman and also because I have ideas, a network of contacts and a great deal of management experience. Being there because I'm a woman doesn't take away from my merits or my competence.\"",
      "section": "Inspiring Women at Inteli",
      "subsection": "Women, resist!"
    },
    {
      "type": "subsection_title",
      "level": 2,
      "text": "Paths towards diversity",
      "section": "Inspiring Women at Inteli",
      "subsection": "Paths towards diversity"
    },
    {
      "type": "paragraph",
      "text": "When it comes to working towards equality in the world of work, Maíra believes that it is essential to go beyond fine speeches and invest in effective actions. For example, by opting for blind recruitment, companies have the chance to analyze only the candidates' skills in the first stages, without exposing the name, gender, age, location or educational institution where the candidate graduated.",
      "section": "Inspiring Women at Inteli",
      "subsection": "Paths towards diversity"
    },
    {
      "type": "paragraph",
      "text": "The advantages? Selection processes are generally much less biased. Blind selection is a public commitment by the company to a more diverse environment. And that's good for everyone. But you have to go beyond affirmative action. \"Companies need to accompany this employee and ensure that the path to leadership is fair. For example, a woman who has been away for six months because of maternity leave will naturally be behind a guy who hasn't stopped,\" warns Maristela.",
      "section": "Inspiring Women at Inteli",
      "subsection": "Paths towards diversity"
    },
    {
      "type": "subsection_title",
      "level": 2,
      "text": "Tip from a friend!",
      "section": "Inspiring Women at Inteli",
      "subsection": "Tip from a friend!"
    },
    {
      "type": "paragraph",
      "text": "\"Not all the variables in your life are going to be perfect all the time. Choose what your priorities are and how to optimize your life. Possibilities will appear all the time, but it's much easier to make decisions when you know what you want and what values matter to you.\" Maristela Calazans",
      "section": "Inspiring Women at Inteli",
      "subsection": "Tip from a friend!",
      "original_count": 2
    },
    {
      "type": "paragraph",
      "text": "\"I say that I am me, no matter where I am. Where I am, I try to do things I love. I work happily because this is where I want to be.\" Flávia Santoro",
      "section": "Inspiring Women at Inteli",
      "subsection": "Tip from a friend!",
      "original_count": 2
    },
    {
      "type": "paragraph",
      "text": "\"We know that two of the factors that contribute to any successful career are building a strong networking network and having inspiring mentors. In the end, asSofia Estevessays: 'we are a bit of everyone'. I always try to surround myself with people I can learn from. Always keep in mind: hang out with people who make you feel better. Maira Habimorad",
      "section": "Inspiring Women at Inteli",
      "subsection": "Tip from a friend!",
      "original_count": 2
    },
    {
      "type": "list_block",
      "text": "See also:\n\n- Graduation,Tech Market,Selection Process,Academic Team",
      "section": "Inspiring Women at Inteli",
      "subsection": "Tip from a friend!",
      "original_count": 1
    },
    {
      "type": "paragraph",
      "text": "The connected world starts here: real projects with the Internet of Things",
      "section": "Inspiring Women at Inteli",
      "subsection": "Tip from a friend!"
    },
    {
      "type": "list_block",
      "text": "The connected world starts here: real projects with the Internet of Things\n\n- Bruna Mayer\n- 13/10/2025\n- Graduation,Selection Process,Academic Team",
      "section": "Inspiring Women at Inteli",
      "subsection": "Tip from a friend!",
      "original_count": 3
    },
    {
      "type": "paragraph",
      "text": "What is the difference between Computer Engineering and Software Engineering?",
      "section": "Inspiring Women at Inteli",
      "subsection": "Tip from a friend!"
    },
    {
      "type": "list_block",
      "text": "What is the difference between Computer Engineering and Software Engineering?\n\n- Renato Penha\n- 30/09/2025\n- Tech Market",
      "section": "Inspiring Women at Inteli",
      "subsection": "Tip from a friend!",
      "original_count": 3
    },
    {
      "type": "paragraph",
      "text": "The start of the professional journey",
      "section": "Inspiring Women at Inteli",
      "subsection": "Tip from a friend!"
    },
    {
      "type": "list_block",
      "text": "The start of the professional journey\n\n- Inteli Team\n- 08/02/2024",
      "section": "Inspiring Women at Inteli",
      "subsection": "Tip from a friend!",
      "original_count": 2
    }
  ],
  "statistics": {
    "total_blocks": 25,
    "paragraphs": 20,
    "headings": 4,
    "list_items": 13,
    "tables": 0
  }
}