{
  "source_file": "en_mulheres-o-mundo-da-computacao-tambem-e-nosso.html",
  "metadata": {
    "url": "en_mulheres-o-mundo-da-computacao-tambem-e-nosso",
    "title": "Women, the world of Computing is ours too - Inteli - Institute of Technology and Leadership",
    "description": "At Inteli, women take their place in technology. Learn about the trajectory of those who have transformed challenges into inspiration and are fighting for greater equity in STEM.",
    "keywords": [],
    "page_type": "geral"
  },
  "content_blocks": [
    {
      "type": "paragraph",
      "text": "Inteli>Graduation>Women, the world of Computing is ours too",
      "section": null,
      "subsection": null
    },
    {
      "type": "section_title",
      "level": 1,
      "text": "Women, the world of Computing is ours too",
      "section": "Women, the world of Computing is ours too",
      "subsection": null
    },
    {
      "type": "list_block",
      "text": "Inteli>Graduation>Women, the world of Computing is ours too\n\n- Flavia Santoro\n- 18 Oct 2025\n- Flavia Santoro\n- 18 Oct 2025",
      "section": "Women, the world of Computing is ours too",
      "subsection": null,
      "original_count": 4
    },
    {
      "type": "paragraph",
      "text": "Thirty-five years ago, I began my journey into the fantastic world of computing. Determined to work from an early age, I studied Electronics at CEFET/RJ, and then Electronic Engineering at UFRJ - in a class of 50 men and only two women. I was never intimidated, even when some teachers said that it wasn't a girl's place. I continued to study hard and seek my place.",
      "section": "Women, the world of Computing is ours too",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "While my children were growing up, I was fulfilling my dreams, such as a post-doctorate at the Pierre et Marie Curie Paris VI University in France and the Queensland University of Technology in Australia. I continued to travel the world organizing workshops and conferences until the day two friends, Ig and Seiji, presented the Inteli project - a technology college with a totally project-based teaching methodology. It was love at first sight.",
      "section": "Women, the world of Computing is ours too",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Today I'm here, at the head of the academic area. Can you imagine if I had believed those who pointed the finger saying that Computing wasn't for me?",
      "section": "Women, the world of Computing is ours too",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "But I'm still bothered by the fact that there are still so few girls venturing into the field. And if careers in the sector offer the best salaries, flexibility and job vacancies, why haven't women taken over the benches at tech universities?",
      "section": "Women, the world of Computing is ours too",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "A survey byEquality STEMusing data from Inep's Higher Education Census shows that between 2010 and 2019, female participation in the total number of graduates was 29.5% in 2010 and rose to 33.7% in 2019, a total increase of 4.2% over the period or, on average, 0.47% per year. If this rate continues, the minimum level of gender parity in STEM (45%) would be reached in 24 years.",
      "section": "Women, the world of Computing is ours too",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "TheGirls' career aspirations in STEMstudy helps to understand what might be the drivers of girls' aspirations when they are making choices about which course to follow at university. One of the findings is that contextual factors, family background and general societal beliefs about women in STEM can influence girls' career interests and aspirations.",
      "section": "Women, the world of Computing is ours too",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "The lack of female representation in many areas of technology can make women feel discouraged from entering the field.",
      "section": "Women, the world of Computing is ours too",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Here at Inteli, our project-based teaching model provides equal opportunities for everyone to learn, build and act towards a world of equity. We support student organizations that seek to welcome women and put discussions such as gender equality on the agenda. We actively participate in talks at schools to encourage girls to take part in our selection process. And, of course, we set an example as an institution with female leaders.",
      "section": "Women, the world of Computing is ours too",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "I believe that we need to be proactive, dedicated and never stop studying. It's important to always engage in the tech community to create networks of support and solidarity with other women in the field. We can support each other, share our experiences and knowledge and collaborate on projects.",
      "section": "Women, the world of Computing is ours too",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "I believe that women should feel confident and continue the fight for greater representation and inclusion in the field. Together, we can break down barriers and create a more inclusive and diverse environment in technology.",
      "section": "Women, the world of Computing is ours too",
      "subsection": null
    },
    {
      "type": "list_block",
      "text": "See also:\n\n- Graduation,Tech Market,Selection Process,Academic Team",
      "section": "Women, the world of Computing is ours too",
      "subsection": null,
      "original_count": 1
    },
    {
      "type": "paragraph",
      "text": "The connected world starts here: real projects with the Internet of Things",
      "section": "Women, the world of Computing is ours too",
      "subsection": null
    },
    {
      "type": "list_block",
      "text": "The connected world starts here: real projects with the Internet of Things\n\n- Bruna Mayer\n- 13/10/2025\n- Graduation,Selection Process,Academic Team",
      "section": "Women, the world of Computing is ours too",
      "subsection": null,
      "original_count": 3
    },
    {
      "type": "paragraph",
      "text": "What is the difference between Computer Engineering and Software Engineering?",
      "section": "Women, the world of Computing is ours too",
      "subsection": null
    },
    {
      "type": "list_block",
      "text": "What is the difference between Computer Engineering and Software Engineering?\n\n- Renato Penha\n- 30/09/2025\n- Tech Market",
      "section": "Women, the world of Computing is ours too",
      "subsection": null,
      "original_count": 3
    },
    {
      "type": "paragraph",
      "text": "The start of the professional journey",
      "section": "Women, the world of Computing is ours too",
      "subsection": null
    },
    {
      "type": "list_block",
      "text": "The start of the professional journey\n\n- Inteli Team\n- 08/02/2024",
      "section": "Women, the world of Computing is ours too",
      "subsection": null,
      "original_count": 2
    }
  ],
  "statistics": {
    "total_blocks": 20,
    "paragraphs": 14,
    "headings": 1,
    "list_items": 13,
    "tables": 0
  }
}