{
  "source_file": "en_o-inicio-da-jornada-profissional.html",
  "metadata": {
    "url": "en_o-inicio-da-jornada-profissional",
    "title": "The start of the professional journey - Inteli - Institute of Technology and Leadership",
    "description": "",
    "keywords": [],
    "page_type": "geral"
  },
  "content_blocks": [
    {
      "type": "paragraph",
      "text": "Inteli>Tech Market>The start of the professional journey",
      "section": null,
      "subsection": null
    },
    {
      "type": "section_title",
      "level": 1,
      "text": "The start of the professional journey",
      "section": "The start of the professional journey",
      "subsection": null
    },
    {
      "type": "list_block",
      "text": "Inteli>Tech Market>The start of the professional journey\n\n- Inteli Team\n- 8 Feb 2024\n- Inteli Team\n- 8 Feb 2024",
      "section": "The start of the professional journey",
      "subsection": null,
      "original_count": 4
    },
    {
      "type": "paragraph",
      "text": "Find out how Inteli students are preparing for regular internships and balancing work and studies",
      "section": "The start of the professional journey",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "As we begin a new year, we are celebrating another important chapter in our history: as provided for in the academic model, the degree is no longer full time and students are now doing six-hour internships.",
      "section": "The start of the professional journey",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "And it is during internships that young people have the chance to apply theoretical knowledge to real scenarios in the technology job market.\"The challenge is to develop resilience by working on longer-term projects, which don't always have the support structure of the project-based learning methodology,\"says Raj Rani, Director of Human Resources and the Center for Leadership Development (CDL).",
      "section": "The start of the professional journey",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Do you want to know how our students are preparing to kick-start their career management? Join us for this article!",
      "section": "The start of the professional journey",
      "subsection": null
    },
    {
      "type": "subsection_title",
      "level": 2,
      "text": "Navigating between studies and internship",
      "section": "The start of the professional journey",
      "subsection": "Navigating between studies and internship"
    },
    {
      "type": "paragraph",
      "text": "The internship is the ideal time to experience practical challenges, develop skills and gain an in-depth understanding of the demands and trends of the job market. Another advantage is building a network of contacts that can open doors to future career opportunities.",
      "section": "The start of the professional journey",
      "subsection": "Navigating between studies and internship"
    },
    {
      "type": "paragraph",
      "text": "Although our methodological proposal has a strong connection with the job market, where students develop projects for various organizations, this is the first time that the third-year class is dividing its time and presence between college and internship sites.",
      "section": "The start of the professional journey",
      "subsection": "Navigating between studies and internship"
    },
    {
      "type": "paragraph",
      "text": "In this process, it is essential tolearn how to negotiate deadlines and set limits. \"The academic journey and the internship experience play an important role in shaping students as future professionals, so it's important that students organize themselves to get the best out of it,\" says Raj.",
      "section": "The start of the professional journey",
      "subsection": "Navigating between studies and internship"
    },
    {
      "type": "paragraph",
      "text": "Henrique Marlon, from the Computer Engineering course, will be working at Cartesi as aDeveloper Advocate. For him, one of the priorities is toensure a smooth transition between academic and professional commitments, prioritizing open communication with the parties involved.",
      "section": "The start of the professional journey",
      "subsection": "Navigating between studies and internship"
    },
    {
      "type": "paragraph",
      "text": "Sophia Dias, from the Information Systems course, is going to be part of the Amazon team, and also believes that time management is fundamental to balancing the new responsibilities.",
      "section": "The start of the professional journey",
      "subsection": "Navigating between studies and internship"
    },
    {
      "type": "paragraph",
      "text": "\"Inteli offers a practical approach to learning, which has helped me develop a strong ability to manage multiple tasks and deadlines,\"says Sophia.",
      "section": "The start of the professional journey",
      "subsection": "Navigating between studies and internship"
    },
    {
      "type": "paragraph",
      "text": "Gábrio Lina, who is studying Computer Science and eager to start his internship at Morgan Stanley, says that the support of the Center for Development and Leadership (CDL) has been fundamental during this process.",
      "section": "The start of the professional journey",
      "subsection": "Navigating between studies and internship"
    },
    {
      "type": "paragraph",
      "text": "\"We are entering a time of building our careers and our future, and having this support is very significant.\"",
      "section": "The start of the professional journey",
      "subsection": "Navigating between studies and internship"
    },
    {
      "type": "subsection_title",
      "level": 2,
      "text": "Internship and Personal Development Curator",
      "section": "The start of the professional journey",
      "subsection": "Internship and Personal Development Curator"
    },
    {
      "type": "paragraph",
      "text": "Inteli believes that training a technology professional goes far beyond theoretical content. In addition to developing communication, teamwork and leadership skills, our students are guided to make the best choices for their careers.",
      "section": "The start of the professional journey",
      "subsection": "Internship and Personal Development Curator"
    },
    {
      "type": "paragraph",
      "text": "In preparation for the internships, the highlight was Careers Week, full of self-knowledge activities, preparation for interviews and internships, and direct contact with the companies so that the selection processes could begin internally.",
      "section": "The start of the professional journey",
      "subsection": "Internship and Personal Development Curator"
    },
    {
      "type": "paragraph",
      "text": "Another important point is the work done by CDL to curate and publicize internship opportunities, helping students to focus and prioritize when faced with so many options.",
      "section": "The start of the professional journey",
      "subsection": "Internship and Personal Development Curator"
    },
    {
      "type": "paragraph",
      "text": "\"The reflections from the individual consultations with the career development specialists are very important because they help the students to create more assertive strategies,\" says Raj.",
      "section": "The start of the professional journey",
      "subsection": "Internship and Personal Development Curator"
    },
    {
      "type": "paragraph",
      "text": "Monitoring during internships will also include six-monthly surveys to measure student satisfaction and regular meetings so that everyone can share their experiences. Another initiative is adialog with companies with theaim of understanding how interns are being perceived by managers.",
      "section": "The start of the professional journey",
      "subsection": "Internship and Personal Development Curator"
    },
    {
      "type": "paragraph",
      "text": "Sophia believes that this support from CDL will be fundamental to building a solid foundation for successfully navigating the internship.  \"I hope that the continuous feedback and performance evaluation will help me to identify areas for improvement and to grow professionally, thinking about my individual development plan,\" she says.",
      "section": "The start of the professional journey",
      "subsection": "Internship and Personal Development Curator"
    },
    {
      "type": "subsection_title",
      "level": 2,
      "text": "Expectations",
      "section": "The start of the professional journey",
      "subsection": "Expectations"
    },
    {
      "type": "paragraph",
      "text": "Henrique says he is particularly excited about developing his skills in RISC-V microarchitecture. \"I believe this experience will offer valuable insights and significant challenges that will contribute to my professional growth.\"",
      "section": "The start of the professional journey",
      "subsection": "Expectations"
    },
    {
      "type": "paragraph",
      "text": "Sophia, for her part, hopes to immerse herself in the supply chain area at Amazon, valuing the analytical skills developed at Inteli. \"I'm looking forward to learning about the operation of a global company and the organization of its teams. Understanding Amazon's structure and processes will allow me to gain a valuable perspective on effective management on a large scale, something that is essential for my aspiration of an international career,\" she adds.",
      "section": "The start of the professional journey",
      "subsection": "Expectations"
    },
    {
      "type": "paragraph",
      "text": "In addition to high expectations, the students are engaging in intensive preparation. Henrique wants to improve his English and programming skills, while Sophia has decided to focus on reviewing technology concepts and business strategies.",
      "section": "The start of the professional journey",
      "subsection": "Expectations"
    },
    {
      "type": "paragraph",
      "text": "Gábrio has dedicated himself to doing technical and conceptual research and delving into the most relevant content. \"In areas where software development is involved, knowing about the fundamental concepts and logic of programming is very important, so whenever possible I revise as much as possible,\" he says.",
      "section": "The start of the professional journey",
      "subsection": "Expectations"
    },
    {
      "type": "paragraph",
      "text": "What do the three students have in common?The desire to develop interpersonal skills, such as communication and collaboration.A great advantage for the students is that they have already had an intensive in Inteli's own leadership curriculum.",
      "section": "The start of the professional journey",
      "subsection": "Expectations"
    },
    {
      "type": "paragraph",
      "text": "\"Thenature of project-based studyis playing a vital role in this process. Collaboration on projects with numerous classmates, feedback and interaction with professors and experienced professionals in the technology and business sector allow me to actively develop these and other skills,\" reflects Gábrio.",
      "section": "The start of the professional journey",
      "subsection": "Expectations"
    },
    {
      "type": "paragraph",
      "text": "Finally, Raj stresses that Inteli's main objective is for the internships to be a platform for experimentation.\"We want to help our students to be the protagonists of their career choices.\"",
      "section": "The start of the professional journey",
      "subsection": "Expectations"
    },
    {
      "type": "list_block",
      "text": "See also:\n\n- Graduation,Tech Market,Selection Process,Academic Team",
      "section": "The start of the professional journey",
      "subsection": "Expectations",
      "original_count": 1
    },
    {
      "type": "paragraph",
      "text": "The connected world starts here: real projects with the Internet of Things",
      "section": "The start of the professional journey",
      "subsection": "Expectations"
    },
    {
      "type": "list_block",
      "text": "The connected world starts here: real projects with the Internet of Things\n\n- Bruna Mayer\n- 13/10/2025\n- Graduation,Selection Process,Academic Team",
      "section": "The start of the professional journey",
      "subsection": "Expectations",
      "original_count": 3
    },
    {
      "type": "paragraph",
      "text": "What is the difference between Computer Engineering and Software Engineering?",
      "section": "The start of the professional journey",
      "subsection": "Expectations"
    },
    {
      "type": "list_block",
      "text": "What is the difference between Computer Engineering and Software Engineering?\n\n- Renato Penha\n- 30/09/2025\n- Academic Team",
      "section": "The start of the professional journey",
      "subsection": "Expectations",
      "original_count": 3
    },
    {
      "type": "paragraph",
      "text": "From the club to the bit: the epic of technologies to computing",
      "section": "The start of the professional journey",
      "subsection": "Expectations"
    },
    {
      "type": "list_block",
      "text": "From the club to the bit: the epic of technologies to computing\n\n- Mauricio Garcia\n- 01/11/2023",
      "section": "The start of the professional journey",
      "subsection": "Expectations",
      "original_count": 2
    }
  ],
  "statistics": {
    "total_blocks": 38,
    "paragraphs": 29,
    "headings": 4,
    "list_items": 13,
    "tables": 0
  }
}