{
  "source_file": "en_por-que-acreditamos-que-o-futuro-do-brasil-passa-por-uma-nova-educacao.html",
  "metadata": {
    "url": "en_por-que-acreditamos-que-o-futuro-do-brasil-passa-por-uma-nova-educacao",
    "title": "Why do we believe that Brazil's future lies in a new education? - Inteli - Institute of Technology and Leadership",
    "description": "",
    "keywords": [],
    "page_type": "geral"
  },
  "content_blocks": [
    {
      "type": "paragraph",
      "text": "Inteli>Tech Market>Why do we believe that the future of Brazil lies in a new education?",
      "section": null,
      "subsection": null
    },
    {
      "type": "section_title",
      "level": 1,
      "text": "Why do we believe that the future of Brazil depends on a new education?",
      "section": "Why do we believe that the future of Brazil depends on a new education?",
      "subsection": null
    },
    {
      "type": "list_block",
      "text": "Inteli>Tech Market>Why do we believe that the future of Brazil lies in a new education?\n\n- Maira Habimorad\n- 17 Sep 2025\n- Maira Habimorad\n- 17 Sep 2025",
      "section": "Why do we believe that the future of Brazil depends on a new education?",
      "subsection": null,
      "original_count": 4
    },
    {
      "type": "paragraph",
      "text": "Brazil is in a hurry. We are facing a historic crossroads: either we profoundly transform our educational model, or we will continue to reproduce inequalities and waste talent. Technological acceleration, the emergence of new professions and the rapid change in the profile of organizations no longer allow for slow or superficial responses.",
      "section": "Why do we believe that the future of Brazil depends on a new education?",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "We need to train young people to lead transformations in their communities and sectors. We believe that the country's future inevitably involves a new education that is more connected to reality and to the social challenges that Brazil needs to face head on.",
      "section": "Why do we believe that the future of Brazil depends on a new education?",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Artificial intelligence is already changing the world of work. And just as the steam engine drove the Industrial Revolution, AI has the potential to redefine our economy. Advanced models developed by companies such as OpenAI, Google and Meta mark the beginning of a new era that could generate up toUS$4.4 trillion in productivity gains.Even so, only 1% of companies consider themselves mature in the use of AI. In other words: everyone is investing, but few know what to do with it.",
      "section": "Why do we believe that the future of Brazil depends on a new education?",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "This reality demands something we are not yet delivering: a generation capable of using technology responsibly, creatively and with impact. A generation prepared to deal with ethical dilemmas, make complex decisions and create solutions to problems we don't even know about yet. And this is not a distant prediction. Brazil already has a shortage of more than 530,000 technology professionals, and the time to react is now.",
      "section": "Why do we believe that the future of Brazil depends on a new education?",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "It was based on this diagnosis - and a refusal to accept \"more of the same\" - that we created Inteli. A higher education institution committed exclusively to excellence, based in São Paulo, which combines academic knowledge, market practice and social responsibility. The proposal was born from the private sector, but with a public commitment: to train leaders who think big and contribute to positioning Brazil as a leading player in an increasingly technological and interdependent global scenario.",
      "section": "Why do we believe that the future of Brazil depends on a new education?",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Here, students face real problems right from the start of their degree. It's not just about learning theory, but about applying, testing, making mistakes and improving. A recent example of this was the partnership withCompanhia de Trens Metropolitanos(CPTM). Durante 10 semanas, estudantes do terceiro ano de Engenharia da Computação trabalharam no desenvolvimento do novo aplicativo da empresa, que será lançado ainda este ano. Participaram de reuniões com a equipe de tecnologia da CPTM, definiram funcionalidades e aplicaram, na prática, conteúdos de mobile, UX design, microservices e gestão de projetos.",
      "section": "Why do we believe that the future of Brazil depends on a new education?",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "O app contará com recursos como mapas interativos, localização em tempo real dos trens e informações úteis ao redor das estações. Tudo isso voltado aos 1,6 milhão de passageiros que usam o sistema diariamente. Segundo o presidente da companhia, Michael Cerqueira, esse é um exemplo concreto de como unir o setor público ao ambiente acadêmico gera resultados reais para a população — e mostra o valor de investir em inovação e na juventude brasileira. Para nós, essa é a educação.",
      "section": "Why do we believe that the future of Brazil depends on a new education?",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Claro que o modelo do Inteli não é uma resposta única. Mas é uma tentativa séria, estruturada e ousada de construir um caminho diferente, com base em evidências, parcerias, rigor acadêmico e abertura para o novo.",
      "section": "Why do we believe that the future of Brazil depends on a new education?",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Sabemos que não vamos resolver tudo sozinhos. E também não achamos que isso será simples ou rápido. Mas estamos convencidos de que é possível, e urgente, fazer diferente. Por isso, deixamos aqui um convite direto a quem compartilha dessa preocupação: lideranças públicas, empresas, educadores e famílias. O futuro não vai esperar. O que está em jogo não é apenas o destino de uma geração, mas o projeto de país que queremos construir. Compartilhe: Veja também:",
      "section": "Why do we believe that the future of Brazil depends on a new education?",
      "subsection": null,
      "original_count": 3
    },
    {
      "type": "list_block",
      "text": "Veja também:\n\n- Graduação,Mercado Tech,Processo Seletivo,Time Acadêmico",
      "section": "Why do we believe that the future of Brazil depends on a new education?",
      "subsection": null,
      "original_count": 1
    },
    {
      "type": "paragraph",
      "text": "O mundo conectado começa aqui: projetos reais com Internet das Coisas",
      "section": "Why do we believe that the future of Brazil depends on a new education?",
      "subsection": null
    },
    {
      "type": "list_block",
      "text": "O mundo conectado começa aqui: projetos reais com Internet das Coisas\n\n- Bruna Mayer\n- 13/10/2025\n- Graduação,Processo Seletivo,Time Acadêmico",
      "section": "Why do we believe that the future of Brazil depends on a new education?",
      "subsection": null,
      "original_count": 3
    },
    {
      "type": "paragraph",
      "text": "Qual a diferença entre Engenharia de Computação e Engenharia de Software?",
      "section": "Why do we believe that the future of Brazil depends on a new education?",
      "subsection": null
    },
    {
      "type": "list_block",
      "text": "Qual a diferença entre Engenharia de Computação e Engenharia de Software?\n\n- Renato Penha\n- 30/09/2025\n- Mercado Tech",
      "section": "Why do we believe that the future of Brazil depends on a new education?",
      "subsection": null,
      "original_count": 3
    },
    {
      "type": "paragraph",
      "text": "O início da jornada profissional",
      "section": "Why do we believe that the future of Brazil depends on a new education?",
      "subsection": null
    },
    {
      "type": "list_block",
      "text": "O início da jornada profissional\n\n- Time Inteli\n- 08/02/2024",
      "section": "Why do we believe that the future of Brazil depends on a new education?",
      "subsection": null,
      "original_count": 2
    }
  ],
  "statistics": {
    "total_blocks": 19,
    "paragraphs": 15,
    "headings": 1,
    "list_items": 13,
    "tables": 0
  }
}