{
  "source_file": "faq.html",
  "metadata": {
    "url": "faq",
    "title": "Perguntas Frequentes - Inteli - Instituto de Tecnologia e Liderança",
    "description": "",
    "keywords": [],
    "page_type": "geral"
  },
  "content_blocks": [
    {
      "type": "section_title",
      "level": 1,
      "text": "Perguntas Frequentes",
      "section": "Perguntas Frequentes",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "R$7.780,00e taxa de matricula de R$R$ 2.350,00.",
      "section": "Perguntas Frequentes",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "*Os valores da mensalidade são para entrantes em 2026. Os valores para 2027 serão divulgados até a data da matrícula, considerando a correção da inflação confirmada até dezembro de 2026.",
      "section": "Perguntas Frequentes",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Sim. O Inteli tem parcerias internacionais de intercâmbio com renomadas faculdades nos Estados Unidos, Itália, México, Espanha, Holanda, Nova Zelândia e Argentina. Essas parcerias vão ampliar os horizontes, melhorar a fluência no idioma estrangeiro, abrir portas para te conectar com profissionais e empresas, e criar mais oportunidades de networking.Nosso compromisso é oferecer uma experiência única de aprendizado com um modelo disruptivo, baseado 100% em projetos, e sabemos o quanto o intercâmbio potencializa esse aprendizado. Acesse olinke e saiba mais informações sobre as faculdades. Sim, para agendar a sua visita basta se inscrever aqui:https://www.inteli.edu.br/campus/ Sim, atualmente contamos com uma pós-graduação em CyberSecurity que você pode conferiraqui",
      "section": "Perguntas Frequentes",
      "subsection": null,
      "original_count": 3
    },
    {
      "type": "paragraph",
      "text": "Nossoprograma de Bolsasfoi criado para que jovens talentos possam estudar no Inteli, independente de condição financeira.",
      "section": "Perguntas Frequentes",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "As bolsas podem custear integral ou parcialmente as mensalidades do ensino do Inteli. Além disso, para os alunos com comprovada necessidade, contaremos com auxílio estudantil para custos relacionados à moradia e à alimentação. 4 anos para cursos de Graduação. 15 meses para cursos de Pós-Graduação.",
      "section": "Perguntas Frequentes",
      "subsection": null,
      "original_count": 3
    },
    {
      "type": "paragraph",
      "text": "Os cursos exec possuem duração variável, indo desde eventos curtos, de um dia, até média duração, de 1 a 2 meses.",
      "section": "Perguntas Frequentes",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Sim, após um primeiro ano comum, o aluno, mediante disponibilidade de vagas, pode escolher mudar de curso no segundo ano.",
      "section": "Perguntas Frequentes",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Sim, o aluno pode concluir a dupla titulação em, no mínimo, 5 anos. A dupla titulação funciona da seguinte forma: o aluno começa ambos os cursos em período integral, já que o primeiro ano é comum a todos No segundo e terceiro ano, o aluno escolhe um dos cursos para seguir. No quarto ano, as aulas passam a ser no período noturno, e os alunos desenvolvem o projeto de conclusão de curso, que também é comum a todos os cursos. Nesse momento, no quarto ano, o aluno pode estudar em período integral o segundo curso, enquanto conclui o primeiro à noite. Com um ano adicional, o aluno conclui o segundo curso e obtém a dupla titulação. É importante ressaltar que, no quarto ano, não será possível trabalhar devido à carga horária integral e noturna acumuladas.",
      "section": "Perguntas Frequentes",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Sim, você pode. O Processo de Transferência ocorre mediante análise curricular, envio de documentações, entrevista individual, e etapa de perfil e de projeto, similar ao nosso processo seletivo. O Time Acadêmico do Inteli faz a análise necessária e apresenta o resultado final.",
      "section": "Perguntas Frequentes",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Não. O Inteli é uma instituição privada sem fins lucrativos fundada pelos emprésarios André Esteves e Roberto Sallouti, a partir da doação da Família Esteves. O Inteli conta com o apoio institucional do BTG Pactual no desenvolvimento de suas atividades.",
      "section": "Perguntas Frequentes",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Não. As instalações do Inteli estão sediadas dentro da cidade universitária, através do IPT Open Experience.",
      "section": "Perguntas Frequentes",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "O programa prevê que parceiros da iniciativa privada, com planos de trabalho de pesquisa, desenvolvimento, inovação e formação de recursos humanos, podem desenvolver suas atividades no campus. Saiba mais sobre o IPT Open Experience",
      "section": "Perguntas Frequentes",
      "subsection": null,
      "original_count": 2
    },
    {
      "type": "paragraph",
      "text": "O IPT, a USP e outras instituições, como o Instituto Butantã, tem instalações na Cidade Universitária de São Paulo. As instituições possuem administrações independentes.",
      "section": "Perguntas Frequentes",
      "subsection": null
    }
  ],
  "statistics": {
    "total_blocks": 14,
    "paragraphs": 18,
    "headings": 1,
    "list_items": 0,
    "tables": 0
  }
}