{
  "source_file": "inteli-divulga-colaboracao-com-ibm-em-projetos-academicos-e-estrutura-tecnologica.html",
  "metadata": {
    "url": "inteli-divulga-colaboracao-com-ibm-em-projetos-academicos-e-estrutura-tecnologica",
    "title": "Inteli divulga colaboração com IBM - Inteli - Instituto de Tecnologia e Liderança",
    "description": "",
    "keywords": [],
    "page_type": "geral"
  },
  "content_blocks": [
    {
      "type": "paragraph",
      "text": "Inteli>Vida no Campus>Inteli divulga colaboração com IBM",
      "section": null,
      "subsection": null
    },
    {
      "type": "section_title",
      "level": 1,
      "text": "Inteli divulga colaboração com IBM",
      "section": "Inteli divulga colaboração com IBM",
      "subsection": null
    },
    {
      "type": "list_block",
      "text": "Inteli>Vida no Campus>Inteli divulga colaboração com IBM\n\n- Time Inteli\n- 11 ago 2023\n- Time Inteli\n- 11 ago 2023",
      "section": "Inteli divulga colaboração com IBM",
      "subsection": null,
      "original_count": 4
    },
    {
      "type": "paragraph",
      "text": "INTELI DIVULGA COLABORAÇÃO COM IBM EM PROJETOS ACADÊMICOS E ESTRUTURA TECNOLÓGICA",
      "section": "Inteli divulga colaboração com IBM",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Masterclasses para os alunos e fornecimento de tecnologia IBM para iniciativas estudantis são alguns dos benefícios da cooperação.",
      "section": "Inteli divulga colaboração com IBM",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "O Instituto de Tecnologia e Liderança (Inteli) vai colaborar com o IBM SkillsBuild para o desenvolvimento de projetos que apoiem a trilha acadêmica de alunos e professores. Como parte da iniciativa, a empresa de tecnologia vai oferecer conteúdos, por meio de masterclasses com especialistas, do programa IBM SkillsBuild e da participação no desenvolvimento de projetos dos alunos disponibilizando ferramentas e mentoria de seus especialistas, além de acesso a soluções para a estrutura tecnológica do instituto.",
      "section": "Inteli divulga colaboração com IBM",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Para Maíra Habimorad, CEO do Inteli, a colaboração reforça um dos pilares de ensino da faculdade, que é preparar seus alunos para o mercado de trabalho, colocando-os em contato com grandes empresas desde o início do curso.",
      "section": "Inteli divulga colaboração com IBM",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "“Nossa metodologia de ensino baseada em projetos foi desenvolvida para aproximar o ambiente universitário do mercado de trabalho. Nossa colaboração com IBM Skillsbuild amplia a possibilidade de capacitação de nossos alunos, ao permitir que eles tenham contato com as tecnologias que apoiem em sua formação profissional”, explica.",
      "section": "Inteli divulga colaboração com IBM",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "A colaboração acadêmica prevê a disponibilização de materiais e conteúdos em módulos dos cursos disponibilizados por meio do IBM SkillsBuild para estudantes e professores dos cursos de Engenharia de Computação, Engenharia de Software, Ciência da Computação e Sistemas de Informação, nos temas de Cloud, AI e Data, Cybersecurity e Design Thinking, que serão um grande apoio nos projetos a serem desenvolvidos pelos alunos.",
      "section": "Inteli divulga colaboração com IBM",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Do ponto de vista acadêmico, a cooperação fortalece a formação profissional, proporcionando aos alunos o contato com as tecnologias de uma empresa que é referência no mercado. Os estudantes também terão acesso a certificações das trilhas de aprendizado, intensificando a experiência e agregando em sua formação e currículo.",
      "section": "Inteli divulga colaboração com IBM",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Além da parte acadêmica, o Inteli passará a contar com tecnologia IBM em áreas estratégicas do instituto com o objetivo de reforçar sua estrutura tecnológica, iniciando com soluções de cibersegurança e com projetos em discussão para automação da gestão do acervo acadêmico digital, governança e IBM Cloud para gestão de acessos, além das soluções em inteligência artificial com Watson Assistant focadas em secretaria virtual e construção de grades de aulas personalizadas para acompanhar os alunos em suas jornadas acadêmicas.",
      "section": "Inteli divulga colaboração com IBM",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "“A cooperação com o Inteli é uma das iniciativas que fazem parte do compromisso global da IBM para treinar 30 milhões de pessoas em novas tecnologias até 2030. Acreditamos que fomentar a educação e apoiar o desenvolvimento de novos talentos e suas habilidades, é investir nos avanços tecnológicos para as necessidades do futuro, apoiando a carreira de futuros profissionais.”",
      "section": "Inteli divulga colaboração com IBM",
      "subsection": null
    },
    {
      "type": "subsection_title",
      "level": 2,
      "text": "Teoria e prática caminhando de mãos dadas",
      "section": "Inteli divulga colaboração com IBM",
      "subsection": "Teoria e prática caminhando de mãos dadas"
    },
    {
      "type": "paragraph",
      "text": "O Inteli é a primeira faculdade no Brasil com um ensino baseado em projetos. A instituição abre, a cada semestre, um chamamento público para que empresas, ONGs e o setor público inscrevam projetos com desafios reais de suas operações, e que tenham potencial para serem solucionados por meio da aplicação de tecnologia.",
      "section": "Inteli divulga colaboração com IBM",
      "subsection": "Teoria e prática caminhando de mãos dadas"
    },
    {
      "type": "paragraph",
      "text": "Os gestores das organizações parceiras acompanham durante dez semanas a evolução dos projetos em encontros quinzenais com os alunos, em que são exercitadas as competências de tecnologia, de negócios e habilidades socioemocionais.",
      "section": "Inteli divulga colaboração com IBM",
      "subsection": "Teoria e prática caminhando de mãos dadas"
    },
    {
      "type": "paragraph",
      "text": "Divididos em grupos e com desafios de acordo com o seu ano de estudo, os alunos conseguem aplicar o conhecimento adquirido nas aulas em situações já conectadas com as necessidades de grandes empresas em diversos segmentos. Tudo isso é feito para que a faculdade forme profissionais cientes das necessidades e dificuldades do mercado e capazes de utilizar a tecnologia como ferramenta de resolução Compartilhe: Veja também:",
      "section": "Inteli divulga colaboração com IBM",
      "subsection": "Teoria e prática caminhando de mãos dadas",
      "original_count": 3
    },
    {
      "type": "list_block",
      "text": "Veja também:\n\n- Graduação,Mercado Tech,Processo Seletivo,Time Acadêmico",
      "section": "Inteli divulga colaboração com IBM",
      "subsection": "Teoria e prática caminhando de mãos dadas",
      "original_count": 1
    },
    {
      "type": "paragraph",
      "text": "O mundo conectado começa aqui: projetos reais com Internet das Coisas",
      "section": "Inteli divulga colaboração com IBM",
      "subsection": "Teoria e prática caminhando de mãos dadas"
    },
    {
      "type": "list_block",
      "text": "O mundo conectado começa aqui: projetos reais com Internet das Coisas\n\n- Bruna Mayer\n- 13/10/2025\n- Graduação,Processo Seletivo,Time Acadêmico",
      "section": "Inteli divulga colaboração com IBM",
      "subsection": "Teoria e prática caminhando de mãos dadas",
      "original_count": 3
    },
    {
      "type": "paragraph",
      "text": "Qual a diferença entre Engenharia de Computação e Engenharia de Software?",
      "section": "Inteli divulga colaboração com IBM",
      "subsection": "Teoria e prática caminhando de mãos dadas"
    },
    {
      "type": "list_block",
      "text": "Qual a diferença entre Engenharia de Computação e Engenharia de Software?\n\n- Renato Penha\n- 30/09/2025\n- Mercado Tech",
      "section": "Inteli divulga colaboração com IBM",
      "subsection": "Teoria e prática caminhando de mãos dadas",
      "original_count": 3
    },
    {
      "type": "paragraph",
      "text": "O início da jornada profissional",
      "section": "Inteli divulga colaboração com IBM",
      "subsection": "Teoria e prática caminhando de mãos dadas"
    },
    {
      "type": "list_block",
      "text": "O início da jornada profissional\n\n- Time Inteli\n- 08/02/2024",
      "section": "Inteli divulga colaboração com IBM",
      "subsection": "Teoria e prática caminhando de mãos dadas",
      "original_count": 2
    }
  ],
  "statistics": {
    "total_blocks": 23,
    "paragraphs": 18,
    "headings": 2,
    "list_items": 13,
    "tables": 0
  }
}