{
  "source_file": "mulheres-alunas-do-inteli-e-lideres-do-futuro.html",
  "metadata": {
    "url": "mulheres-alunas-do-inteli-e-lideres-do-futuro",
    "title": "Mulheres, alunas do Inteli e líderes do futuro - Inteli - Instituto de Tecnologia e Liderança",
    "description": "",
    "keywords": [],
    "page_type": "geral"
  },
  "content_blocks": [
    {
      "type": "paragraph",
      "text": "Inteli>Vida do Aluno>Mulheres, alunas do Inteli e líderes do futuro",
      "section": null,
      "subsection": null
    },
    {
      "type": "section_title",
      "level": 1,
      "text": "Mulheres, alunas do Inteli e líderes do futuro",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": null
    },
    {
      "type": "list_block",
      "text": "Inteli>Vida do Aluno>Mulheres, alunas do Inteli e líderes do futuro\n\n- Time Inteli\n- 30 mar 2023\n- Time Inteli\n- 30 mar 2023",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": null,
      "original_count": 4
    },
    {
      "type": "paragraph",
      "text": "Conheça as meninas por trás da gestão da Central Estudantil, do Movimento Negro Benedito Caravelas e do coletivo Grace Hoper.",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Nem todo mundo sabe, mas o primeiro algoritmo para ser processado em máquinas foi criado por Ada Lovelace, matemática inglesa considerada a fundadora da Ciência da Computação e a primeira programadora da história. Mais de um século depois, as mulheres ainda seguem lutando por reconhecimento dentro do universo da tecnologia.",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Assim como na época da Ada, a lista de desafios para seguir a carreira de tecnologia continua sendo enorme para as mulheres, como estereótipos de gênero, poucas inspirações femininas, viés inconsciente, cultura de trabalho tóxica e falta de incentivos.",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Aqui no Inteli, a gente arregaça as mangas desde o dia 1 para que mais meninas ocupem o espaço de destaque e o protagonismo que merecem.",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "E para conversar sobre essa caminhada, nada melhor do que bater um papo com três mulheres incríveis que estão fazendo história por aqui.",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Malu Maia, 18 anos; Thainá Lima, 18 anos e Tainara Rodrigues, 20 anos, fazem parte da nossa primeira turma e  lideram três grupos estudantis que agitam a comunidade Inteli.",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Spoiler: elas concordam que ainda têm muito trabalho para se fazer. Mas sabem que têm todo o suporte para criar um ambiente acolhedor para que outras meninas se sintam bem-vindas a transformar o mundo por meio da tecnologia.",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": null
    },
    {
      "type": "subsection_title",
      "level": 2,
      "text": "A jornada até o Inteli",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": "A jornada até o Inteli"
    },
    {
      "type": "paragraph",
      "text": "Jovem negra, Thainá cresceu em Vitória da Conquista, na Bahia, bem pertinho de um quilombo. “A minha mãe começou a trabalhar desde criança, então ela me ensinou que educação era a única coisa que ninguém poderia tirar de mim. Todo dia ela me fala que eu vou mudar o mundo”, conta Thainá.",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": "A jornada até o Inteli"
    },
    {
      "type": "paragraph",
      "text": "Fascinada por tecnologia, ela começou a explorar os próprios interesses por conta própria. Ganhou uma bolsa de estudos do Sesi, entrou no mundo da robótica e participou de projetos de pesquisa em equipe e da Feira Brasileira de Jovens Cientistas. “Minha paixão pela tecnologia se estendeu para outras áreas, incluindo o desenvolvimento de bicicletas compartilhadas com preços mais acessíveis para a comunidade”.",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": "A jornada até o Inteli"
    },
    {
      "type": "paragraph",
      "text": "Já para a Malu, o despertar para o mundo tech aconteceu durante a pandemia, quando ela percebeu o quanto poderia contribuir para a área.",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": "A jornada até o Inteli"
    },
    {
      "type": "paragraph",
      "text": "O suporte também veio da mãe  professora de Economia, que incentivou Malu a lutar pelos seus sonhos. “Minha mãe saiu do interior de Minas e foi para Belo Horizonte para estudar quando tinha apenas 16 anos. Ela sempre foi uma mulher inspiradora e praticamente me criou sozinha”, relembra.",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": "A jornada até o Inteli"
    },
    {
      "type": "paragraph",
      "text": "Tainara nasceu e cresceu no estado do Ceará, e desde criança sempre aspirava se tornar uma mulher que ultrapassasse fronteiras. Durante o ensino médio, conquistou a medalha de bronze na Olimpíada de Ciências e menção honrosa na OBMEP, além de participar de projetos na USP.  Ingressou no projeto Constituição das Escolas e se tornou bolsista no Anglo. Até o dia que as histórias da Thainá, da Malu e Tainara se cruzaram aqui no Inteli.",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": "A jornada até o Inteli",
      "original_count": 2
    },
    {
      "type": "subsection_title",
      "level": 2,
      "text": "Protagonismo feminino",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": "Protagonismo feminino"
    },
    {
      "type": "paragraph",
      "text": "Odireito das meninas de irem à escolafoi reconhecido somente em 1827, após a Independência do Brasil. Ou seja, a presença ainda tímida de mulheres nos cursos de Tecnologia têm raízes históricas profundas. A luta por equidade não pode parar. “A tecnologia como um espaço masculino é uma construção social, mas eu acredito no nosso potencial de mudar essa realidade”, reforça Tainara.",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": "Protagonismo feminino"
    },
    {
      "type": "paragraph",
      "text": "As meninas relembram o choque inicial quando chegaram no Inteli. Além das salas de aula majoritariamente masculinas, elas precisaram lidar com os desafios de uma metodologia de ensino completamente inovadora. “Foi um susto para todo mundo. Tivemos que aprender a nos organizar para dar conta. E sempre tivemos o suporte da faculdade e, principalmente, o apoio uma da outra”, conta Malu. As três jovens assumiram ainda a liderança de grupos estudantis, o que elas consideram uma grande oportunidade de colocar em prática o que aprendem em sala de aula.",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": "Protagonismo feminino"
    },
    {
      "type": "subsection_title",
      "level": 2,
      "text": "Liderança dos grupos estudantis",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": "Liderança dos grupos estudantis"
    },
    {
      "type": "paragraph",
      "text": "Thainá é fundadora e presidente doMovimento Negro Benedito Caravelas, organização com o objetivo de trabalhar questões relacionadas ao racismo estrutural e os impactos nas áreas de tecnologia.",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": "Liderança dos grupos estudantis"
    },
    {
      "type": "paragraph",
      "text": "Dentre as iniciativas do grupo, destaque para o Afroiá Tech, que trouxe lideranças negras da área de tecnologia para compartilhar experiências com os alunos.",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": "Liderança dos grupos estudantis"
    },
    {
      "type": "paragraph",
      "text": "“O encontro foi um divisor de águas pra gente. Recebemos CEOs negros aqui no Inteli e foi incrïvel. Eu senti que tudo o que já passei tinha valido muito a pena. Precisamos manter esse sentimento de comunidade e de resistência”.",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": "Liderança dos grupos estudantis"
    },
    {
      "type": "paragraph",
      "text": "Malu foi eleita a primeira Presidente daCentral Estudantile teve o desafio de oferecer – durante o tempo em que esteve no cargo – suporte para todos os grupos do Inteli. As ações englobam planejamento de eventos, agendamento de encontros dos clubes, atividades de convivência, e ponto de comunicação entre os estudantes e o Inteli. “Aqui dentro, estamos aprendendo a ser líderes melhores. Atualmente são oito clubes e mais de 300 alunos, e às vezes é bem desafiador conciliar tudo. E eu fico muito feliz em ver os grupos crescendo, conquistando prêmios e realizando o que eles se dispõem a fazer”, destaca.",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": "Liderança dos grupos estudantis"
    },
    {
      "type": "paragraph",
      "text": "A Tainara lidera oGrace Hopper, grupo que une as mulheres do Inteli fisicamente para compartilhar experiências e aprendizados, oferecer apoio emocional e trocar impressões sobre livros e eventos relacionados à causa feminista.",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": "Liderança dos grupos estudantis"
    },
    {
      "type": "paragraph",
      "text": "“Tem sido muito gratificante trazer mulheres que inspiram a gente e ter esse canal de troca com outras meninas. Para esse ano, esperamos desenvolver mais projetos com os outros clubes e promover empatia dos estudantes”.",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": "Liderança dos grupos estudantis"
    },
    {
      "type": "paragraph",
      "text": "As jovens compartilham o senso de responsabilidade em receber mais meninas no Inteli e garantir que elas se sintam confortáveis e confiantes. “Queremos ser a prova viva de que tudo vai dar certo. Vamos voltar como CEOs um dia”, promete Malu. Compartilhe: Veja também:",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": "Liderança dos grupos estudantis",
      "original_count": 3
    },
    {
      "type": "list_block",
      "text": "Veja também:\n\n- Graduação,Mercado Tech,Processo Seletivo,Time Acadêmico",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": "Liderança dos grupos estudantis",
      "original_count": 1
    },
    {
      "type": "paragraph",
      "text": "O mundo conectado começa aqui: projetos reais com Internet das Coisas",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": "Liderança dos grupos estudantis"
    },
    {
      "type": "list_block",
      "text": "O mundo conectado começa aqui: projetos reais com Internet das Coisas\n\n- Bruna Mayer\n- 13/10/2025\n- Graduação,Processo Seletivo,Time Acadêmico",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": "Liderança dos grupos estudantis",
      "original_count": 3
    },
    {
      "type": "paragraph",
      "text": "Qual a diferença entre Engenharia de Computação e Engenharia de Software?",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": "Liderança dos grupos estudantis"
    },
    {
      "type": "list_block",
      "text": "Qual a diferença entre Engenharia de Computação e Engenharia de Software?\n\n- Renato Penha\n- 30/09/2025\n- Mercado Tech",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": "Liderança dos grupos estudantis",
      "original_count": 3
    },
    {
      "type": "paragraph",
      "text": "O início da jornada profissional",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": "Liderança dos grupos estudantis"
    },
    {
      "type": "list_block",
      "text": "O início da jornada profissional\n\n- Time Inteli\n- 08/02/2024",
      "section": "Mulheres, alunas do Inteli e líderes do futuro",
      "subsection": "Liderança dos grupos estudantis",
      "original_count": 2
    }
  ],
  "statistics": {
    "total_blocks": 34,
    "paragraphs": 28,
    "headings": 4,
    "list_items": 13,
    "tables": 0
  }
}