{
  "source_file": "mulheres-inspiradoras-no-inteli.html",
  "metadata": {
    "url": "mulheres-inspiradoras-no-inteli",
    "title": "Mulheres Inspiradoras no Inteli - Inteli - Instituto de Tecnologia e Liderança",
    "description": "",
    "keywords": [],
    "page_type": "geral"
  },
  "content_blocks": [
    {
      "type": "paragraph",
      "text": "Inteli>Vida no Campus>Mulheres Inspiradoras no Inteli",
      "section": null,
      "subsection": null
    },
    {
      "type": "section_title",
      "level": 1,
      "text": "Mulheres Inspiradoras no Inteli",
      "section": "Mulheres Inspiradoras no Inteli",
      "subsection": null
    },
    {
      "type": "list_block",
      "text": "Inteli>Vida no Campus>Mulheres Inspiradoras no Inteli\n\n- Time Inteli\n- 24 abr 2023\n- Time Inteli\n- 24 abr 2023",
      "section": "Mulheres Inspiradoras no Inteli",
      "subsection": null,
      "original_count": 4
    },
    {
      "type": "paragraph",
      "text": "Painel discute o poder da diversidade no ambiente corporativo",
      "section": "Mulheres Inspiradoras no Inteli",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Um dos nossos objetivos como faculdade de tecnologia é empoderar as mulheres para que elas ocupem mais cargos de liderança nessa indústria ainda dominada por homens. Mas você já parou pra pensar por que não temos mais pessoas do gênero feminino pensando em soluções tecnológicas e trabalhando na área?",
      "section": "Mulheres Inspiradoras no Inteli",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "A gente acredita que é fundamental discutir as raízes do problema para ir em busca das soluções que realmente funcionem para o nosso país. Por exemplo, a pesquisa latinoamericana Women in Technology, da Michael Page, mostra que para 47% dos profissionais C-level que responderam ao estudo, o número de mulheres em TI ainda é baixo no Brasil porque faltam modelos inspiradores para as mulheres.",
      "section": "Mulheres Inspiradoras no Inteli",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Para discutir esse tema, reunimos Maíra Habimorad, CEO do Inteli; Flávia Santoro, Diretora Acadêmica do Inteli e pesquisadora na área da tecnologia, e Maristela Calazans, Diretora de Tecnologia Nubank, em um  encontro inspirador para as nossas alunas e os nossos alunos. “Para nós, é muito importante ajudá-los nesta jornada de aprendizado e de transformação para termos uma sociedade com mais equidade de gênero, plural, diversa e humana”, reforça Maíra. Confira alguns destaques do bate-papo!",
      "section": "Mulheres Inspiradoras no Inteli",
      "subsection": null,
      "original_count": 2
    },
    {
      "type": "subsection_title",
      "level": 2,
      "text": "Mulheres, resistam!",
      "section": "Mulheres Inspiradoras no Inteli",
      "subsection": "Mulheres, resistam!"
    },
    {
      "type": "paragraph",
      "text": "Para Flávia Santoro, a falta de representação feminina em muitas áreas da tecnologia pode fazer com que as mulheres se sintam desencorajadas a entrar no campo. Além disso, existem preconceitos inconscientes e estereótipos que podem levar à discriminação de gênero no ambiente de trabalho. “Precisamos ser proativas, dedicadas e nunca parar de estudar. É importante estar sempre engajada na comunidade de tecnologia para criar redes de suporte e solidariedade com outras mulheres na área”, destaca.",
      "section": "Mulheres Inspiradoras no Inteli",
      "subsection": "Mulheres, resistam!"
    },
    {
      "type": "paragraph",
      "text": "Maristela, que vem construindo uma carreira de destaque na área, comentou como ainda se  sente um cisne negro ao ser abordada para oportunidades profissionais incríveis por ser mulher. “No começo eu me sentia super mal, quase culpada. Depois eu fui entendendo que em alguns momentos é importante forçar a barra para ter diversidade. A gente está evoluindo como sociedade, e precisa ser assim até que as pessoas comecem a achar natural”, reforça.",
      "section": "Mulheres Inspiradoras no Inteli",
      "subsection": "Mulheres, resistam!"
    },
    {
      "type": "paragraph",
      "text": "Maíra conta que ao ser convidada para fazer parte de um Conselho de Administração, tinha quase certeza que uma das grandes razões era por ser mulher. “Ao invés de me sentir ofendida, eu sentei à mesa e falei: OK, estou aqui porque sou mulher e também porque eu tenho ideias, uma rede de contatos e uma grande experiência em gestão. Estar ali por ser mulher não tira meus méritos e nem a minha competência”.",
      "section": "Mulheres Inspiradoras no Inteli",
      "subsection": "Mulheres, resistam!"
    },
    {
      "type": "subsection_title",
      "level": 2,
      "text": "Caminhos rumo à diversidade",
      "section": "Mulheres Inspiradoras no Inteli",
      "subsection": "Caminhos rumo à diversidade"
    },
    {
      "type": "paragraph",
      "text": "Quando o assunto é a caminhada pela equidade no mundo do trabalho, Maíra acredita que é fundamental ir além dos discursos bonitos e investir em ações efetivas. Por exemplo, ao optar pelo recrutamento às cegas, as empresas têm a chance de analisar apenas as competências dos candidatos nas primeiras etapas, sem expor nome, gênero, idade, localização ou instituição de ensino onde o candidato se formou.",
      "section": "Mulheres Inspiradoras no Inteli",
      "subsection": "Caminhos rumo à diversidade"
    },
    {
      "type": "paragraph",
      "text": "As vantagens? Os processos seletivos geralmente são muito menos enviesados. A seleção às cegas é um compromisso público da empresa com um ambiente mais diverso. E isso é bom pra todo mundo. Mas é preciso ir além das vagas afirmativas. “As empresas precisam acompanhar esse colaborador e garantir que o percurso rumo à liderança seja justo. Por exemplo, uma mulher que ficou fora por seis meses por causa de uma licença-maternidade vai estar naturalmente atrás de um cara que não parou”, alerta Maristela.",
      "section": "Mulheres Inspiradoras no Inteli",
      "subsection": "Caminhos rumo à diversidade"
    },
    {
      "type": "subsection_title",
      "level": 2,
      "text": "Dica de amiga!",
      "section": "Mulheres Inspiradoras no Inteli",
      "subsection": "Dica de amiga!"
    },
    {
      "type": "paragraph",
      "text": "“Nem todas as variáveis da sua vida vão estar perfeitas o tempo todo. Escolha quais são as suas prioridades e como otimizar a sua vida. Possibilidades vão aparecer o tempo todo, mas é muito mais fácil tomar decisões quando você sabe o que quer e quais são os valores que importam pra você”. Maristela Calazans",
      "section": "Mulheres Inspiradoras no Inteli",
      "subsection": "Dica de amiga!",
      "original_count": 2
    },
    {
      "type": "paragraph",
      "text": "“Eu digo que eu sou eu, independente de onde eu esteja. Onde eu estou, eu busco fazer coisas que eu amo. Eu trabalho feliz porque aqui é o lugar que eu quero estar”. Flávia Santoro",
      "section": "Mulheres Inspiradoras no Inteli",
      "subsection": "Dica de amiga!",
      "original_count": 2
    },
    {
      "type": "paragraph",
      "text": "“A gente sabe que dois dos fatores que contribuem para qualquer carreira de sucesso é construir uma forte rede de networking e ter mentores inspiradores. No final, como diz aSofia Esteves: ‘a gente é um pouco de todo mundo’. Eu sempre tento estar rodeada de pessoas com quem eu aprendo. Tenha sempre em mente: conviva com pessoas que fazem você se sentir melhor”. Maira Habimorad Compartilhe: Veja também:",
      "section": "Mulheres Inspiradoras no Inteli",
      "subsection": "Dica de amiga!",
      "original_count": 4
    },
    {
      "type": "list_block",
      "text": "Veja também:\n\n- Graduação,Mercado Tech,Processo Seletivo,Time Acadêmico",
      "section": "Mulheres Inspiradoras no Inteli",
      "subsection": "Dica de amiga!",
      "original_count": 1
    },
    {
      "type": "paragraph",
      "text": "O mundo conectado começa aqui: projetos reais com Internet das Coisas",
      "section": "Mulheres Inspiradoras no Inteli",
      "subsection": "Dica de amiga!"
    },
    {
      "type": "list_block",
      "text": "O mundo conectado começa aqui: projetos reais com Internet das Coisas\n\n- Bruna Mayer\n- 13/10/2025\n- Graduação,Processo Seletivo,Time Acadêmico",
      "section": "Mulheres Inspiradoras no Inteli",
      "subsection": "Dica de amiga!",
      "original_count": 3
    },
    {
      "type": "paragraph",
      "text": "Qual a diferença entre Engenharia de Computação e Engenharia de Software?",
      "section": "Mulheres Inspiradoras no Inteli",
      "subsection": "Dica de amiga!"
    },
    {
      "type": "list_block",
      "text": "Qual a diferença entre Engenharia de Computação e Engenharia de Software?\n\n- Renato Penha\n- 30/09/2025\n- Mercado Tech",
      "section": "Mulheres Inspiradoras no Inteli",
      "subsection": "Dica de amiga!",
      "original_count": 3
    },
    {
      "type": "paragraph",
      "text": "O início da jornada profissional",
      "section": "Mulheres Inspiradoras no Inteli",
      "subsection": "Dica de amiga!"
    },
    {
      "type": "list_block",
      "text": "O início da jornada profissional\n\n- Time Inteli\n- 08/02/2024",
      "section": "Mulheres Inspiradoras no Inteli",
      "subsection": "Dica de amiga!",
      "original_count": 2
    }
  ],
  "statistics": {
    "total_blocks": 25,
    "paragraphs": 22,
    "headings": 4,
    "list_items": 13,
    "tables": 0
  }
}