{
  "source_file": "o-futuro-da-tecnologia-precisa-de-mais-meninas.html",
  "metadata": {
    "url": "o-futuro-da-tecnologia-precisa-de-mais-meninas",
    "title": "O futuro da tecnologia precisa de mais meninas - Inteli - Instituto de Tecnologia e Liderança",
    "description": "",
    "keywords": [],
    "page_type": "geral"
  },
  "content_blocks": [
    {
      "type": "paragraph",
      "text": "Inteli>Mercado Tech>O futuro da tecnologia precisa de mais meninas",
      "section": null,
      "subsection": null
    },
    {
      "type": "section_title",
      "level": 1,
      "text": "O futuro da tecnologia precisa de mais meninas",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": null
    },
    {
      "type": "list_block",
      "text": "Inteli>Mercado Tech>O futuro da tecnologia precisa de mais meninas\n\n- Time Inteli\n- 20 abr 2023\n- Time Inteli\n- 20 abr 2023",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": null,
      "original_count": 4
    },
    {
      "type": "paragraph",
      "text": "Maíra Habimorad, CEO Inteli, escreveu sobreos caminhos que as meninas precisam trilhar no mercado de trabalho e como o Inteli está direcionando seu olhar e compromisso para a formação de mais meninas na área da tecnologia.",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": null
    },
    {
      "type": "subsection_title",
      "level": 2,
      "text": "Por que o mundo da tecnologia ainda não atrai tantas meninas?",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": "Por que o mundo da tecnologia ainda não atrai tantas meninas?"
    },
    {
      "type": "paragraph",
      "text": "Tara Westover pisou em uma sala de aula pela primeira vez aos 17 anos. Isolada em uma fazenda no interior de Idaho, ela cresceu sem poder ir à escola, graças ao fanatismo do pai que acreditava que o fim do mundo estava próximo.  A americana conta sua jornada inspiradora – de uma educaçāo formal tardia até o doutorado em Cambridge – no livro“A menina das montanhas”. Após os primeiros anos de faculdade, ao questionar se deveria continuar os estudos ou seguir o mesmo destino das mulheres de sua família, Tara ouviu de um professor um conselho que mudou a sua história:“Primeiro descubra do que você é capaz. Depois decida o que vai fazer com isso”.",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": "Por que o mundo da tecnologia ainda não atrai tantas meninas?"
    },
    {
      "type": "paragraph",
      "text": "Um dos meus sonhos é que mais meninas sigam os passos de Tara e de outras mulheres talentosas e descubram o enorme potencial que carregam quando podem ter acesso à uma educação emancipadora. Como CEO do Inteli, posso dizer que temos trabalhado desde o primeiro dia para que essas jovens talentosas sintam que aqui é o lugar para que elas aprendam tecnologia e sejam líderes do futuro.",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": "Por que o mundo da tecnologia ainda não atrai tantas meninas?"
    },
    {
      "type": "paragraph",
      "text": "Mesmo após um esforço imenso de comunicação e ações específicas durante o vestibular, as meninas ainda são minoria em sala de aula (25% do total). E por que isso importa?",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": "Por que o mundo da tecnologia ainda não atrai tantas meninas?"
    },
    {
      "type": "subsection_title",
      "level": 2,
      "text": "A equidade de gênero é fundamental na tecnologia",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": "A equidade de gênero é fundamental na tecnologia"
    },
    {
      "type": "paragraph",
      "text": "A relevância da equidade de gênero nas carreiras ligadas à ciência, tecnologia, engenharia e matemática (STEM) vai além do debate sobre mercado de trabalho. Como diz a jornalista e ativistaCaroline Criado Perezno livroInvisible Women: Exposing Data Bias In A World Designed For Men,“se estamos desenhando um mundo que deve funcionar para todos, precisamos incluir mulheres na sala de comando”. Aliás, o trabalho de Caroline é fundamental para entender como o gap de gênero na era do big data pode tornar metade da população mundial completamente invisível. Trazer mais meninas para as faculdades de tecnologia e prepará-las para o mercado de trabalho do século XXI é uma demanda urgente.",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": "A equidade de gênero é fundamental na tecnologia"
    },
    {
      "type": "paragraph",
      "text": "Em um mundo em que inteligência artificial, metaverso e robôs passam a fazer cada vez mais parte do nosso cotidiano, é fundamental que o desenvolvimento dessas tecnologias não carregue vieses e preconceitos de gênero. Por exemplo,a chance de mulheres sofrerem ferimentos graves em acidentes de carro é 47% maior do que homens. Um dos motivos é que os testes de segurança utilizam dummies – apelido dos manequins utilizados nessas medições – que retratam um homem de corpo médio  (175 cm; 75.5 kg). Ou seja, esses estudos acabam não considerando as variações de peso, altura e posição de dirigir de mulheres, crianças e pessoas idosas.",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": "A equidade de gênero é fundamental na tecnologia"
    },
    {
      "type": "paragraph",
      "text": "Vale lembrar que asfemtechssurgiram apenas na última década para atender às necessidades biológicas femininas, como o monitoramento da menstruação e da fertilidade, e soluções para gravidez, amamentação e menopausa. Outra vez uma das razões para essa demora, considerando que as mulheres representam metade da população global e possuem um alto poder de compra, é a evolução da ciência centrada no corpo masculino.",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": "A equidade de gênero é fundamental na tecnologia"
    },
    {
      "type": "subsection_title",
      "level": 2,
      "text": "Os cursos de tecnologia ainda sāo masculinos",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": "Os cursos de tecnologia ainda sāo masculinos"
    },
    {
      "type": "paragraph",
      "text": "Quando olhamos para as estatísticas, a diferença de performance entre meninas e meninos noPISA 2018na prova de Matemática foi de nove pontos no Brasil, contra cinco na média dos países da OCDE. Em Ciências, enquanto as garotas ficaram dois pontos acima na média global, o desempenho de meninos e meninas foi bem semelhante por aqui.",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": "Os cursos de tecnologia ainda sāo masculinos"
    },
    {
      "type": "paragraph",
      "text": "Entre os estudantes com a maior nota em matemática ou ciências, cerca de um em cada três meninos no Brasil espera trabalhar como engenheiro ou profissional de Ciências aos 30 anos, enquanto apenas uma em cada cinco meninas têm o mesmo desejo. Cerca de duas em cada cinco alunas de alto desempenho esperam trabalhar em profissões ligadas à Saúde. Do lado dos meninos, somente cerca de 25% têm a mesma aspiração.",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": "Os cursos de tecnologia ainda sāo masculinos"
    },
    {
      "type": "paragraph",
      "text": "Levantamento doIgualdade STEMcom dados do Censo da Educação Superior de 2018, do Inep, mostra que das 246 ocupações STEM identificadas pelos pesquisadores, apenas 39 têm maioria feminina – entre elas, biologia e engenharia de alimentos. A desigualdade de gênero é mais acentuada nos cursos das áreas de Tecnologia da Informação e Engenharias. No curso de Redes de Computadores, as alunas correspondem a menos de 8% do total de estudantes e no curso de Engenharia Mecânica, o valor é de 10%.",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": "Os cursos de tecnologia ainda sāo masculinos"
    },
    {
      "type": "paragraph",
      "text": "Ou seja, a maioria das meninas não se interessam por cursos de tecnologia, mesmo sendo totalmente capazes. Mas se as carreiras no setor são as que oferecem melhores salários, flexibilidade e oferta de vagas, por que as mulheres ainda não tomaram conta dos bancos das universidades de tecnologia?",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": "Os cursos de tecnologia ainda sāo masculinos"
    },
    {
      "type": "subsection_title",
      "level": 2,
      "text": "Uma mudança estrutural",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": "Uma mudança estrutural"
    },
    {
      "type": "paragraph",
      "text": "O estudoGirls’ career aspirations in STEMajuda a entender quais podem ser os impulsionadores das aspirações das meninas quando elas estão fazendo escolhas sobre qual curso seguir na faculdade. Um dos achados é que os fatores contextuais, o histórico familiar e as crenças gerais da sociedade em relação às mulheres em STEM podem influenciar os interesses e as aspirações de carreira das meninas.",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": "Uma mudança estrutural"
    },
    {
      "type": "paragraph",
      "text": "Ou seja, precisamos urgentemente oferecer oportunidades desde a educação básica para que as meninas experimentem a tecnologia de uma forma divertida, inspiradora e prática, de forma que consigam se enxergar como programadoras ou engenheiras. Além disso, mídia, empresas, Governo, escolas e famílias precisam se unir para derrubar os estereótipos predominantes de uma sociedade ainda patriarcal.",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": "Uma mudança estrutural"
    },
    {
      "type": "paragraph",
      "text": "Aqui no Inteli, acreditamos também que é fundamental cuidar dos meninos para que eles façam parte da mudança ao lado das meninas. Nosso modelo de ensino pautado em projetos prevê oportunidades iguais para que todos possam aprender, construir e agir em prol de um mundo de equidade.",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": "Uma mudança estrutural"
    },
    {
      "type": "paragraph",
      "text": "Aqui no Inteli, acreditamos que é fundamental criar um espaço criativo, seguro e acolhedor para que mais e mais meninas se interessem por cursos de tecnologia.",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": "Uma mudança estrutural"
    },
    {
      "type": "paragraph",
      "text": "Nosso modelo de ensino pautado em projetos prevê oportunidades iguais para que todos possam aprender, construir e agir em prol de um mundo de equidade.",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": "Uma mudança estrutural"
    },
    {
      "type": "paragraph",
      "text": "Preparamos este vídeo para mostrar um pouco do que é o dia a dia das nossas estudantes. Nossa alegria diária é ver esse Campus cheio de meninas e meninas construindo um futuro inspirador para mais gerações.",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": "Uma mudança estrutural"
    },
    {
      "type": "paragraph",
      "text": "Precisamos urgentemente oferecer oportunidades desde a educação básica para que as meninas experimentem a tecnologia de uma forma divertida, inspiradora e prática, de forma que consigam se enxergar como programadoras ou engenheiras.Aqui no Inteli, acreditamos também que é fundamental cuidar dos meninos para que eles façam parte da mudança ao lado das meninas. Compartilhe: Veja também:",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": "Uma mudança estrutural",
      "original_count": 3
    },
    {
      "type": "list_block",
      "text": "Veja também:\n\n- Graduação,Mercado Tech,Processo Seletivo,Time Acadêmico",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": "Uma mudança estrutural",
      "original_count": 1
    },
    {
      "type": "paragraph",
      "text": "O mundo conectado começa aqui: projetos reais com Internet das Coisas",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": "Uma mudança estrutural"
    },
    {
      "type": "list_block",
      "text": "O mundo conectado começa aqui: projetos reais com Internet das Coisas\n\n- Bruna Mayer\n- 13/10/2025\n- Graduação,Processo Seletivo,Time Acadêmico",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": "Uma mudança estrutural",
      "original_count": 3
    },
    {
      "type": "paragraph",
      "text": "Qual a diferença entre Engenharia de Computação e Engenharia de Software?",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": "Uma mudança estrutural"
    },
    {
      "type": "list_block",
      "text": "Qual a diferença entre Engenharia de Computação e Engenharia de Software?\n\n- Renato Penha\n- 30/09/2025\n- Mercado Tech",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": "Uma mudança estrutural",
      "original_count": 3
    },
    {
      "type": "paragraph",
      "text": "O início da jornada profissional",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": "Uma mudança estrutural"
    },
    {
      "type": "list_block",
      "text": "O início da jornada profissional\n\n- Time Inteli\n- 08/02/2024",
      "section": "O futuro da tecnologia precisa de mais meninas",
      "subsection": "Uma mudança estrutural",
      "original_count": 2
    }
  ],
  "statistics": {
    "total_blocks": 32,
    "paragraphs": 24,
    "headings": 5,
    "list_items": 13,
    "tables": 0
  }
}