{
  "source_file": "o-inicio-da-jornada-profissional.html",
  "metadata": {
    "url": "o-inicio-da-jornada-profissional",
    "title": "O início da jornada profissional - Inteli - Instituto de Tecnologia e Liderança",
    "description": "",
    "keywords": [],
    "page_type": "geral"
  },
  "content_blocks": [
    {
      "type": "paragraph",
      "text": "Inteli>Mercado Tech>O início da jornada profissional",
      "section": null,
      "subsection": null
    },
    {
      "type": "section_title",
      "level": 1,
      "text": "O início da jornada profissional",
      "section": "O início da jornada profissional",
      "subsection": null
    },
    {
      "type": "list_block",
      "text": "Inteli>Mercado Tech>O início da jornada profissional\n\n- Time Inteli\n- 8 fev 2024\n- Time Inteli\n- 8 fev 2024",
      "section": "O início da jornada profissional",
      "subsection": null,
      "original_count": 4
    },
    {
      "type": "paragraph",
      "text": "Descubra como os alunos do Inteli estão se preparando para os estágios regulares e equilibrando trabalho e estudos",
      "section": "O início da jornada profissional",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "À medida que começamos um novo ano, celebramos por aqui mais um capítulo importante da nossa história: como previsto no modelo acadêmico, a graduação deixa de ser integral e os alunos passam a fazer estágios de seis horas.",
      "section": "O início da jornada profissional",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "E é durante os estágios que os jovens têm a chance de aplicar conhecimentos teóricos em cenários reais do mercado de trabalho de tecnologia.“O desafio é desenvolver resiliência trabalhando em projetos de uma duração mais longa, e que nem sempre contam com a estrutura de apoio da metodologia de aprendizagem baseada em projetos”, destaca Raj Rani, Diretor de Recursos Humanos e do Centro de Desenvolvimento de Liderança (CDL).",
      "section": "O início da jornada profissional",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Quer saber como os nossos alunos estão se preparando para dar o pontapé inicial na gestão das suas carreiras? Vem com a gente esse artigo!",
      "section": "O início da jornada profissional",
      "subsection": null
    },
    {
      "type": "subsection_title",
      "level": 2,
      "text": "Navegando entre estudos e estágio",
      "section": "O início da jornada profissional",
      "subsection": "Navegando entre estudos e estágio"
    },
    {
      "type": "paragraph",
      "text": "O estágio é o momento ideal para experimentar desafios práticos, desenvolver habilidades e adquirir uma compreensão aprofundada das demandas e tendências do mercado de trabalho. Outra vantagem é a construção de uma rede de contatos que pode abrir portas para futuras oportunidades de carreira.",
      "section": "O início da jornada profissional",
      "subsection": "Navegando entre estudos e estágio"
    },
    {
      "type": "paragraph",
      "text": "Por mais que a nossa proposta metodológica tenha uma conexão forte com o mercado de trabalho onde os alunos desenvolvem projetos para diversas organizações, é a primeira vez que a turma do terceiro ano começa a dividir o tempo e presença entre faculdade e locais de estágio.",
      "section": "O início da jornada profissional",
      "subsection": "Navegando entre estudos e estágio"
    },
    {
      "type": "paragraph",
      "text": "Nesse processo, é fundamentalaprender a negociar prazos e estabelecer limites. “A jornada acadêmica e a experiência nos estágios têm papéis importantes na formação dos alunos como futuros profissionais, por isso é importante que os alunos se organizem para tirar o melhor proveito”, reforça Raj.",
      "section": "O início da jornada profissional",
      "subsection": "Navegando entre estudos e estágio"
    },
    {
      "type": "paragraph",
      "text": "Henrique Marlon, do curso de Engenharia de Computação, vai estagiar na Cartesi comoDeveloper Advocate. Para ele, uma das prioridades égarantir uma transição suave entre os compromissos acadêmicos e profissionais, priorizando uma comunicação aberta com as partes envolvidas.",
      "section": "O início da jornada profissional",
      "subsection": "Navegando entre estudos e estágio"
    },
    {
      "type": "paragraph",
      "text": "Sophia Dias, do curso de Sistemas de Informação, vai fazer parte do time da Amazon, e também acredita que a gestão do tempo é fundamental para equilibrar as novas responsabilidades.",
      "section": "O início da jornada profissional",
      "subsection": "Navegando entre estudos e estágio"
    },
    {
      "type": "paragraph",
      "text": "“O Inteli oferece uma abordagem prática ao aprendizado, que me ajudou a desenvolver uma forte capacidade de gerenciar várias tarefas e prazos”, conta Sophia.",
      "section": "O início da jornada profissional",
      "subsection": "Navegando entre estudos e estágio"
    },
    {
      "type": "paragraph",
      "text": "Cursando Ciência da Computação e ansioso para iniciar o estágio na Morgan Stanley, Gábrio Lina reforça que o suporte do Centro de Desenvolvimento e Liderança (CDL) tem sido fundamental durante esse processo.",
      "section": "O início da jornada profissional",
      "subsection": "Navegando entre estudos e estágio"
    },
    {
      "type": "paragraph",
      "text": "“Nós estamos entrando em um momento de construção da nossa carreira e do nosso futuro, e ter esse apoio é muito significativo”.",
      "section": "O início da jornada profissional",
      "subsection": "Navegando entre estudos e estágio"
    },
    {
      "type": "subsection_title",
      "level": 2,
      "text": "Curadoria de Estágios e Desenvolvimento Pessoal",
      "section": "O início da jornada profissional",
      "subsection": "Curadoria de Estágios e Desenvolvimento Pessoal"
    },
    {
      "type": "paragraph",
      "text": "O Inteli acredita que a formação de um profissional de tecnologia vai muito além do conteúdo teórico. Além de desenvolver habilidades de comunicação, trabalho em equipe e liderança, os nossos alunos são guiados para fazer as melhores escolhas para as suas carreiras.",
      "section": "O início da jornada profissional",
      "subsection": "Curadoria de Estágios e Desenvolvimento Pessoal"
    },
    {
      "type": "paragraph",
      "text": "Na preparação para os estágios, destaque para a Semana de Carreiras, recheada de atividades de autoconhecimento, preparação para entrevistas e estágios, e o contato direto com as empresas para que os processos seletivos começassem internamente.",
      "section": "O início da jornada profissional",
      "subsection": "Curadoria de Estágios e Desenvolvimento Pessoal"
    },
    {
      "type": "paragraph",
      "text": "Outro ponto importante é o trabalho de curadoria e divulgação das oportunidades de estágio realizado pelo CDL, ajudando os alunos a focar e priorizar diante tantas opções.",
      "section": "O início da jornada profissional",
      "subsection": "Curadoria de Estágios e Desenvolvimento Pessoal"
    },
    {
      "type": "paragraph",
      "text": "“As reflexões dos atendimentos individuais com os especialistas de desenvolvimento de carreira são muito importantes porque ajudam os alunos a criarem estratégias mais assertivas”, reforça Raj.",
      "section": "O início da jornada profissional",
      "subsection": "Curadoria de Estágios e Desenvolvimento Pessoal"
    },
    {
      "type": "paragraph",
      "text": "O acompanhamento durante os estágios vai incluir ainda pesquisas semestrais para medir a satisfação dos alunos e encontros periódicos para que todos possam compartilhar suas experiências. Outra iniciativa é odiálogo com as empresascom o objetivo de entender como os estagiários estão sendo percebidos pelos gestores.",
      "section": "O início da jornada profissional",
      "subsection": "Curadoria de Estágios e Desenvolvimento Pessoal"
    },
    {
      "type": "paragraph",
      "text": "Sophia acredita que esse suporte do CDL vai ser fundamental para construir uma base sólida para navegar com sucesso no estágio.  “Espero que o feedback contínuo e a avaliação de desempenho me ajude a identificar áreas de melhoria e a crescer profissionalmente, pensando no meu plano de desenvolvimento individual”, reforça a jovem.",
      "section": "O início da jornada profissional",
      "subsection": "Curadoria de Estágios e Desenvolvimento Pessoal"
    },
    {
      "type": "subsection_title",
      "level": 2,
      "text": "Expectativas",
      "section": "O início da jornada profissional",
      "subsection": "Expectativas"
    },
    {
      "type": "paragraph",
      "text": "Henrique conta que está particularmente entusiasmado em desenvolver suas habilidades em microarquitetura RISC-V. “Acredito que essa experiência oferecerá insights valiosos e desafios significativos que contribuirão para o meu crescimento profissional”.",
      "section": "O início da jornada profissional",
      "subsection": "Expectativas"
    },
    {
      "type": "paragraph",
      "text": "Sophia, por sua vez, espera mergulhar na área de supply chain na Amazon, valorizando as habilidades analíticas desenvolvidas no Inteli. “Estou ansiosa para aprender sobre a operação de uma empresa global e a organização de suas equipes. Compreender a estrutura e os processos da Amazon me permitirá ganhar uma perspectiva valiosa sobre o gerenciamento eficaz em grande escala, algo que é essencial para minha aspiração de uma carreira internacional”, complementa a jovem.",
      "section": "O início da jornada profissional",
      "subsection": "Expectativas"
    },
    {
      "type": "paragraph",
      "text": "Além das expectativas altas, os alunos estão se engajando em uma preparação intensiva. Henrique quer aprimorar suas habilidades em inglês e programação, enquanto Sophia decidiu focar na revisão de conceitos de tecnologia e estratégias de negócios.",
      "section": "O início da jornada profissional",
      "subsection": "Expectativas"
    },
    {
      "type": "paragraph",
      "text": "Gábrio tem se dedicado a fazer pesquisas técnicas e conceituais, e se aprofundar nos conteúdos mais relevantes. “Em áreas onde o desenvolvimento de software está envolvido, conhecer sobre os conceitos fundamentais e a lógica da programação é muito importante, então sempre que possível, reviso ao máximo”, conta.",
      "section": "O início da jornada profissional",
      "subsection": "Expectativas"
    },
    {
      "type": "paragraph",
      "text": "O que os três alunos têm em comum?O desejo em desenvolver habilidades interpessoais, como comunicação e colaboração.Uma grande vantagem para os alunos é que eles já tiveram um intensivo no próprio currículo de liderança do Inteli.",
      "section": "O início da jornada profissional",
      "subsection": "Expectativas"
    },
    {
      "type": "paragraph",
      "text": "“Anatureza do estudo baseado em projetosestá desempenhando um papel vital nesse processo. A colaboração em projetos com inúmeros colegas, feedbacks e a interação com professores e profissionais experientes no setor de tecnologia e negócios me permitem desenvolver essas e outras habilidades de forma ativa”, reflete Gábrio.",
      "section": "O início da jornada profissional",
      "subsection": "Expectativas"
    },
    {
      "type": "paragraph",
      "text": "Por fim, Raj reforça que o principal objetivo do Inteli é que os os estágios sejam uma plataforma de experimentação.“Queremos ajudar os nossos alunos e alunas a serem protagonistas das suas escolhas de carreira”. Compartilhe: Veja também:",
      "section": "O início da jornada profissional",
      "subsection": "Expectativas",
      "original_count": 3
    },
    {
      "type": "list_block",
      "text": "Veja também:\n\n- Graduação,Mercado Tech,Processo Seletivo,Time Acadêmico",
      "section": "O início da jornada profissional",
      "subsection": "Expectativas",
      "original_count": 1
    },
    {
      "type": "paragraph",
      "text": "O mundo conectado começa aqui: projetos reais com Internet das Coisas",
      "section": "O início da jornada profissional",
      "subsection": "Expectativas"
    },
    {
      "type": "list_block",
      "text": "O mundo conectado começa aqui: projetos reais com Internet das Coisas\n\n- Bruna Mayer\n- 13/10/2025\n- Graduação,Processo Seletivo,Time Acadêmico",
      "section": "O início da jornada profissional",
      "subsection": "Expectativas",
      "original_count": 3
    },
    {
      "type": "paragraph",
      "text": "Qual a diferença entre Engenharia de Computação e Engenharia de Software?",
      "section": "O início da jornada profissional",
      "subsection": "Expectativas"
    },
    {
      "type": "list_block",
      "text": "Qual a diferença entre Engenharia de Computação e Engenharia de Software?\n\n- Renato Penha\n- 30/09/2025\n- Time Acadêmico",
      "section": "O início da jornada profissional",
      "subsection": "Expectativas",
      "original_count": 3
    },
    {
      "type": "paragraph",
      "text": "Da clava ao bit: a epopeia das tecnologias até a computação",
      "section": "O início da jornada profissional",
      "subsection": "Expectativas"
    },
    {
      "type": "list_block",
      "text": "Da clava ao bit: a epopeia das tecnologias até a computação\n\n- Mauricio Garcia\n- 01/11/2023",
      "section": "O início da jornada profissional",
      "subsection": "Expectativas",
      "original_count": 2
    }
  ],
  "statistics": {
    "total_blocks": 38,
    "paragraphs": 31,
    "headings": 4,
    "list_items": 13,
    "tables": 0
  }
}