{
  "source_file": "por-que-acreditamos-que-o-futuro-do-brasil-passa-por-uma-nova-educacao.html",
  "metadata": {
    "url": "por-que-acreditamos-que-o-futuro-do-brasil-passa-por-uma-nova-educacao",
    "title": "Por que acreditamos que o futuro do Brasil passa por uma nova educação? - Inteli - Instituto de Tecnologia e Liderança",
    "description": "",
    "keywords": [],
    "page_type": "geral"
  },
  "content_blocks": [
    {
      "type": "paragraph",
      "text": "Inteli>Mercado Tech>Por que acreditamos que o futuro do Brasil passa por uma nova educação?",
      "section": null,
      "subsection": null
    },
    {
      "type": "section_title",
      "level": 1,
      "text": "Por que acreditamos que o futuro do Brasil passa por uma nova educação?",
      "section": "Por que acreditamos que o futuro do Brasil passa por uma nova educação?",
      "subsection": null
    },
    {
      "type": "list_block",
      "text": "Inteli>Mercado Tech>Por que acreditamos que o futuro do Brasil passa por uma nova educação?\n\n- Maira Habimorad\n- 17 set 2025\n- Maira Habimorad\n- 17 set 2025",
      "section": "Por que acreditamos que o futuro do Brasil passa por uma nova educação?",
      "subsection": null,
      "original_count": 4
    },
    {
      "type": "paragraph",
      "text": "O Brasil tem pressa. Estamos diante de uma encruzilhada histórica: ou transformamos profundamente nosso modelo educacional, ou continuaremos reproduzindo desigualdades e desperdiçando talentos. A aceleração tecnológica, o surgimento de novas profissões e a rápida mudança no perfil das organizações não permitem mais respostas lentas ou superficiais.",
      "section": "Por que acreditamos que o futuro do Brasil passa por uma nova educação?",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Precisamos formar jovens para liderar transformações em suas comunidades e setores. Acreditamos que o futuro do país passa, inevitavelmente, por uma nova educação mais conectada com a realidade e com os desafios sociais que o Brasil precisa enfrentar de frente.",
      "section": "Por que acreditamos que o futuro do Brasil passa por uma nova educação?",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "A inteligência artificial já está mudando o mundo do trabalho. E, assim como a máquina a vapor impulsionou a Revolução Industrial, a IA tem potencial para redefinir nossa economia. Modelos avançados desenvolvidos por empresas como OpenAI, Google e Meta marcam o início de uma nova era que pode gerar atéUS$ 4,4 trilhões em ganhos de produtividade.Ainda assim, apenas 1% das empresas se considera madura no uso de IA. Ou seja: todos estão investindo, mas poucos sabem o que fazer com isso.",
      "section": "Por que acreditamos que o futuro do Brasil passa por uma nova educação?",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Essa realidade exige algo que ainda não estamos entregando: uma geração capaz de usar a tecnologia com responsabilidade, criatividade e impacto. Uma geração preparada para lidar com dilemas éticos, tomar decisões complexas e criar soluções para problemas que ainda nem conhecemos. E não se trata de uma previsão distante. O Brasil já tem um déficit de mais de 530 mil profissionais de tecnologia, e o tempo para reagir é agora.",
      "section": "Por que acreditamos que o futuro do Brasil passa por uma nova educação?",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Foi a partir desse diagnóstico — e da recusa em aceitar o “mais do mesmo” — que criamos o Inteli. Uma instituição de ensino superior comprometida exclusivamente com excelência, com sede em São Paulo, que une conhecimento acadêmico, prática de mercado e responsabilidade social. A proposta nasceu do setor privado, mas com compromisso público: formar lideranças que pensem grande e contribuam para posicionar o Brasil como protagonista em um cenário global cada vez mais tecnológico e interdependente.",
      "section": "Por que acreditamos que o futuro do Brasil passa por uma nova educação?",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Aqui, os estudantes enfrentam problemas reais desde o início da graduação. Não se trata apenas de aprender teoria, mas de aplicar, testar, errar e melhorar. Um exemplo recente disso foi a parceria com aCompanhia de Trens Metropolitanos(CPTM). Durante 10 semanas, estudantes do terceiro ano de Engenharia da Computação trabalharam no desenvolvimento do novo aplicativo da empresa, que será lançado ainda este ano. Participaram de reuniões com a equipe de tecnologia da CPTM, definiram funcionalidades e aplicaram, na prática, conteúdos de mobile, UX design, microservices e gestão de projetos.",
      "section": "Por que acreditamos que o futuro do Brasil passa por uma nova educação?",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "O app contará com recursos como mapas interativos, localização em tempo real dos trens e informações úteis ao redor das estações. Tudo isso voltado aos 1,6 milhão de passageiros que usam o sistema diariamente. Segundo o presidente da companhia, Michael Cerqueira, esse é um exemplo concreto de como unir o setor público ao ambiente acadêmico gera resultados reais para a população — e mostra o valor de investir em inovação e na juventude brasileira. Para nós, essa é a educação.",
      "section": "Por que acreditamos que o futuro do Brasil passa por uma nova educação?",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Claro que o modelo do Inteli não é uma resposta única. Mas é uma tentativa séria, estruturada e ousada de construir um caminho diferente, com base em evidências, parcerias, rigor acadêmico e abertura para o novo.",
      "section": "Por que acreditamos que o futuro do Brasil passa por uma nova educação?",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Sabemos que não vamos resolver tudo sozinhos. E também não achamos que isso será simples ou rápido. Mas estamos convencidos de que é possível, e urgente, fazer diferente. Por isso, deixamos aqui um convite direto a quem compartilha dessa preocupação: lideranças públicas, empresas, educadores e famílias. O futuro não vai esperar. O que está em jogo não é apenas o destino de uma geração, mas o projeto de país que queremos construir. Compartilhe: Veja também:",
      "section": "Por que acreditamos que o futuro do Brasil passa por uma nova educação?",
      "subsection": null,
      "original_count": 3
    },
    {
      "type": "list_block",
      "text": "Veja também:\n\n- Graduação,Mercado Tech,Processo Seletivo,Time Acadêmico",
      "section": "Por que acreditamos que o futuro do Brasil passa por uma nova educação?",
      "subsection": null,
      "original_count": 1
    },
    {
      "type": "paragraph",
      "text": "O mundo conectado começa aqui: projetos reais com Internet das Coisas",
      "section": "Por que acreditamos que o futuro do Brasil passa por uma nova educação?",
      "subsection": null
    },
    {
      "type": "list_block",
      "text": "O mundo conectado começa aqui: projetos reais com Internet das Coisas\n\n- Bruna Mayer\n- 13/10/2025\n- Graduação,Processo Seletivo,Time Acadêmico",
      "section": "Por que acreditamos que o futuro do Brasil passa por uma nova educação?",
      "subsection": null,
      "original_count": 3
    },
    {
      "type": "paragraph",
      "text": "Qual a diferença entre Engenharia de Computação e Engenharia de Software?",
      "section": "Por que acreditamos que o futuro do Brasil passa por uma nova educação?",
      "subsection": null
    },
    {
      "type": "list_block",
      "text": "Qual a diferença entre Engenharia de Computação e Engenharia de Software?\n\n- Renato Penha\n- 30/09/2025\n- Mercado Tech",
      "section": "Por que acreditamos que o futuro do Brasil passa por uma nova educação?",
      "subsection": null,
      "original_count": 3
    },
    {
      "type": "paragraph",
      "text": "O início da jornada profissional",
      "section": "Por que acreditamos que o futuro do Brasil passa por uma nova educação?",
      "subsection": null
    },
    {
      "type": "list_block",
      "text": "O início da jornada profissional\n\n- Time Inteli\n- 08/02/2024",
      "section": "Por que acreditamos que o futuro do Brasil passa por uma nova educação?",
      "subsection": null,
      "original_count": 2
    }
  ],
  "statistics": {
    "total_blocks": 19,
    "paragraphs": 15,
    "headings": 1,
    "list_items": 13,
    "tables": 0
  }
}