{
  "source_file": "tecnologia-e-a-nova-administracao.html",
  "metadata": {
    "url": "tecnologia-e-a-nova-administracao",
    "title": "Tecnologia é a nova Administração - Inteli - Instituto de Tecnologia e Liderança",
    "description": "",
    "keywords": [],
    "page_type": "geral"
  },
  "content_blocks": [
    {
      "type": "paragraph",
      "text": "Inteli>Mercado Tech>Tecnologia é a nova Administração",
      "section": null,
      "subsection": null
    },
    {
      "type": "section_title",
      "level": 1,
      "text": "Tecnologia é a nova Administração",
      "section": "Tecnologia é a nova Administração",
      "subsection": null
    },
    {
      "type": "list_block",
      "text": "Inteli>Mercado Tech>Tecnologia é a nova Administração\n\n- Maira Habimorad\n- 17 jun 2024\n- Maira Habimorad\n- 17 jun 2024",
      "section": "Tecnologia é a nova Administração",
      "subsection": null,
      "original_count": 4
    },
    {
      "type": "paragraph",
      "text": "Eu passei boa parte da minha carreira recrutando talentos para grandes empresas no Brasil e na América Latina.",
      "section": "Tecnologia é a nova Administração",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Nos últimos anos, decidi mergulhar no universo da educação superior e, à frente do Inteli, eu tenho refletido e aprendido muito sobre as carreiras do futuro.",
      "section": "Tecnologia é a nova Administração",
      "subsection": null
    },
    {
      "type": "paragraph",
      "text": "Vivemos em um mundo de muitas incertezas com uma verdade absoluta: dominar conhecimentos em tecnologia é o melhor caminho para se destacar no mercado de trabalho nos próximos anos.",
      "section": "Tecnologia é a nova Administração",
      "subsection": null
    },
    {
      "type": "subsection_title",
      "level": 2,
      "text": "CEOs do Futuro já têm algo em comum!",
      "section": "Tecnologia é a nova Administração",
      "subsection": "CEOs do Futuro já têm algo em comum!"
    },
    {
      "type": "paragraph",
      "text": "Quem é jovem há mais tempo lembra bem como era o papel do profissional de tecnologia nas empresas há alguns anos atrás. De maneira geral, a área de TI era vista como um suporte aos processos de negócios, desempenhando um papel discreto, e muitas vezes escondida em pequenas salas isoladas. O profissional era representado pelo antigo nerd,  um perfil visto como mais técnico, isolado, introspectivo e autodidata.",
      "section": "Tecnologia é a nova Administração",
      "subsection": "CEOs do Futuro já têm algo em comum!"
    },
    {
      "type": "paragraph",
      "text": "Tudo começa a mudar quando a tecnologia se torna um campo ampliado e uma área estratégica para as empresas. Os modelos de negócio disruptivos das gigantes Microsoft, Meta, Google, Apple e Amazon, por exemplo, serviram como vetores de mudança em mercados diversificados como entretenimento, saúde, publicidade, consumo, entre outros.",
      "section": "Tecnologia é a nova Administração",
      "subsection": "CEOs do Futuro já têm algo em comum!"
    },
    {
      "type": "paragraph",
      "text": "Como a gente gosta de dizer por aqui no Inteli, todo negócio se tornou um negócio de tecnologia. De acordo com aEmerging Multinationals Research Network (EMRN), rede internacional de pesquisadores, a pandemia acelerou adigitalizaçãodas empresas em dez anos, com as restrições de circulação e a concentração de serviços na internet.",
      "section": "Tecnologia é a nova Administração",
      "subsection": "CEOs do Futuro já têm algo em comum!"
    },
    {
      "type": "paragraph",
      "text": "Em um futuro que está literalmente logo ali, a tecnologia estará integrada em todos os aspectos de nossas vidas e dos negócios. Nesse contexto, a forma como a educação aborda a tecnologia torna-se da máxima importância.",
      "section": "Tecnologia é a nova Administração",
      "subsection": "CEOs do Futuro já têm algo em comum!"
    },
    {
      "type": "paragraph",
      "text": "Aqui no Inteli, a gente dedica muitas horas para pesquisar tendências sobre o futuro. E a nossa aposta é que os cursos que combinam habilidades de computação, tecnologia e negócios são a nova Administração. Sim, os CEOs do futuro vão precisar dominar tecnologia para liderar organizações de pequeno, médio e grande porte.",
      "section": "Tecnologia é a nova Administração",
      "subsection": "CEOs do Futuro já têm algo em comum!"
    },
    {
      "type": "subsection_title",
      "level": 2,
      "text": "Vale a pena fazer faculdade em tecnologia se tudo muda tão rápido?",
      "section": "Tecnologia é a nova Administração",
      "subsection": "Vale a pena fazer faculdade em tecnologia se tudo muda tão rápido?"
    },
    {
      "type": "paragraph",
      "text": "O setor de tecnologia é um dos que mais cresce no país, com uma demanda crescente por soluções digitais que facilitem a vida dos consumidores e aumentem a eficiência dos negócios. Até 2025, a estimativa é de que o Brasil tenha um déficit de 530 mil profissionais de tecnologia, segundo levantamento doGoogle for Startup. O relatório, produzido em parceria com a Associação Brasileira de Startups (Abstartups), aponta que, anualmente, 53 mil profissionais irão se formar entre 2021 e 2025, mas a demanda por novos talentos nesse período será de 800 mil.",
      "section": "Tecnologia é a nova Administração",
      "subsection": "Vale a pena fazer faculdade em tecnologia se tudo muda tão rápido?"
    },
    {
      "type": "paragraph",
      "text": "A qualificação do capital humano em tecnologia é um dos grandes desafios do setor. O profissional de tecnologia do futuro precisa ir além do conhecimento técnico para resolver problemas complexos. Saber se comunicar, trabalhar em equipe, lidar com dilemas morais e éticos, desenvolver resiliência e fazer as melhores escolhas de carreira são habilidades cada vez mais exigidas no mercado.",
      "section": "Tecnologia é a nova Administração",
      "subsection": "Vale a pena fazer faculdade em tecnologia se tudo muda tão rápido?"
    },
    {
      "type": "paragraph",
      "text": "Ou seja, é essencial buscar uma formação acadêmica em tecnologia, mesmo que exista uma narrativa distorcida de que é dispensável fazer faculdade nessa área.Pesquisa da McKinseyrevela que 96% dos fundadores dos unicórnios nos EUA concluíram o ensino superior, sendo que a grande maioria possui mestrado, doutorado ou pós-graduação.",
      "section": "Tecnologia é a nova Administração",
      "subsection": "Vale a pena fazer faculdade em tecnologia se tudo muda tão rápido?"
    },
    {
      "type": "paragraph",
      "text": "No Brasil,estudo da Distrito realizado pela Dataminercom 100 fundadores das 42 principais startups do país mostra que todos são graduados e 57% haviam completado a pós-graduação antes de fundar sua empresa.",
      "section": "Tecnologia é a nova Administração",
      "subsection": "Vale a pena fazer faculdade em tecnologia se tudo muda tão rápido?"
    },
    {
      "type": "subsection_title",
      "level": 2,
      "text": "Existe uma fórmula para escolher uma faculdade de tecnologia?",
      "section": "Tecnologia é a nova Administração",
      "subsection": "Existe uma fórmula para escolher uma faculdade de tecnologia?"
    },
    {
      "type": "paragraph",
      "text": "Ok, então até agora já falamos que os cursos de tecnologia são a nova Administração, que todo negócio é um negócio de tecnologia, e que fazer faculdade ainda é o melhor caminho para quem quer ser o líder do futuro.",
      "section": "Tecnologia é a nova Administração",
      "subsection": "Existe uma fórmula para escolher uma faculdade de tecnologia?"
    },
    {
      "type": "paragraph",
      "text": "E como escolher uma faculdade com um projeto educacional que se posicione na fronteira entre o presente e futuro? Como tem um monte de gente que gosta de matemática aqui no Inteli, nós construímos uma equação bem simples para te ajudar nesse processo tão desafiador.",
      "section": "Tecnologia é a nova Administração",
      "subsection": "Existe uma fórmula para escolher uma faculdade de tecnologia?"
    },
    {
      "type": "subsection_title",
      "level": 2,
      "text": "U = P* (G + E)",
      "section": "Tecnologia é a nova Administração",
      "subsection": "U = P* (G + E)"
    },
    {
      "type": "paragraph",
      "text": "Explicando: auniversidadeideal deve serigualaoseupropósito e da faculdade,multiplicadopelasgarantiasque a instituição te dásomadoàsexperiênciasque você vai ter.",
      "section": "Tecnologia é a nova Administração",
      "subsection": "U = P* (G + E)"
    },
    {
      "type": "paragraph",
      "text": "Ou seja, pense bastante se os seus sonhos e projetos de vida dãomatchcom o que a faculdade define como missão. Pesquise bastante sobre quais são as garantias que a faculdade te oferece de que após quatro anos de graduação, você vai estar realmente preparado para um mercado de trabalho desafiador e em constante mudança. Considere que este é um dos períodos mais importantes da sua vida, e que as experiências na faculdade são super importantes nessa jornada de aprendizado e crescimento pessoal e profissional.",
      "section": "Tecnologia é a nova Administração",
      "subsection": "U = P* (G + E)"
    },
    {
      "type": "paragraph",
      "text": "Eu te garanto aqui no Inteli a gente tem um compromisso diário em entregar aos nossos alunos a melhor experiência possível para pavimentar o seu futuro. Navegue pelo nosso Instagram e nosso blog e descubra por que aqui é o lugar dos jovens que vão transformar o mundo através da tecnologia. Compartilhe: Veja também:",
      "section": "Tecnologia é a nova Administração",
      "subsection": "U = P* (G + E)",
      "original_count": 3
    },
    {
      "type": "list_block",
      "text": "Veja também:\n\n- Graduação,Mercado Tech,Processo Seletivo,Time Acadêmico",
      "section": "Tecnologia é a nova Administração",
      "subsection": "U = P* (G + E)",
      "original_count": 1
    },
    {
      "type": "paragraph",
      "text": "O mundo conectado começa aqui: projetos reais com Internet das Coisas",
      "section": "Tecnologia é a nova Administração",
      "subsection": "U = P* (G + E)"
    },
    {
      "type": "list_block",
      "text": "O mundo conectado começa aqui: projetos reais com Internet das Coisas\n\n- Bruna Mayer\n- 13/10/2025\n- Graduação,Processo Seletivo,Time Acadêmico",
      "section": "Tecnologia é a nova Administração",
      "subsection": "U = P* (G + E)",
      "original_count": 3
    },
    {
      "type": "paragraph",
      "text": "Qual a diferença entre Engenharia de Computação e Engenharia de Software?",
      "section": "Tecnologia é a nova Administração",
      "subsection": "U = P* (G + E)"
    },
    {
      "type": "list_block",
      "text": "Qual a diferença entre Engenharia de Computação e Engenharia de Software?\n\n- Renato Penha\n- 30/09/2025\n- Mercado Tech",
      "section": "Tecnologia é a nova Administração",
      "subsection": "U = P* (G + E)",
      "original_count": 3
    },
    {
      "type": "paragraph",
      "text": "O início da jornada profissional",
      "section": "Tecnologia é a nova Administração",
      "subsection": "U = P* (G + E)"
    },
    {
      "type": "list_block",
      "text": "O início da jornada profissional\n\n- Time Inteli\n- 08/02/2024",
      "section": "Tecnologia é a nova Administração",
      "subsection": "U = P* (G + E)",
      "original_count": 2
    }
  ],
  "statistics": {
    "total_blocks": 31,
    "paragraphs": 23,
    "headings": 5,
    "list_items": 13,
    "tables": 0
  }
}